[{"tag":"real","text":"Exclusive: Aramco agrees on price for Sabic acquisition https:\/\/t.co\/aLCnlKSLAy #OOTT #saudi"},{"tag":"real","text":"#Digitisation contract signed in #SaudiArabia for Two Holy Mosques 🇸🇦  | #Saudi #facman #smartcities https:\/\/t.co\/ke2kyrCqVD"},{"tag":"fake","text":"The #Taliban will not attend planned peace talks with the #US in #Saudi Arabia this month, and want to shift the venue to Qatar, Taliban officials said on Sunday.  https:\/\/t.co\/8bZE6qTWLg https:\/\/t.co\/iSphxdhN4d"},{"tag":"real","text":"#Qatar have used #Khashoggi to write all of the articles in #WashingtonPost beside using him for other purposes against many countries and supporting terrorism groups . https:\/\/t.co\/VlOaPCjpwn"},{"tag":"real","text":"#Saudi sets clear rules and regulations to protect wildlife in the Kingdom. https:\/\/t.co\/UC9bnKBSQy"},{"tag":"real","text":"#Saudi ministry of justice works on developing commercial justice procedures.. https:\/\/t.co\/OzPL3HSyoy"},{"tag":"fake","text":"#فتاه_تايلند\nA #Saudi woman who’s trying to flee into asylum, is being held at #Bangkok airport, after she escaped Saudi Arabia, from #Kuwait to #Thailand. #SaudiArabia is trying to kidnap her back to #KSA If no one interffers, SHE WON’T SEE LIGHT AGAIN. #Save_Rahaf @hrw"},{"tag":"real","text":"#Saudi woman detained in #Thailand seeks asylum in #Canada. She sought asylum in Canada amid doubts about the status of her Australian visa.  https:\/\/t.co\/zJZZPh1gN6"},{"tag":"real","text":"Saudi Government paid SR 6million  blood money to release junaid Khan pakistani this is the reason why i love the great Royal family of Saudi Arabia @HRHMBNSALMAN you are a blessings to the world not only Saudi @HRHMBNSALMAN Saudi is yours no one can take it from you MBS for real https:\/\/t.co\/R23GqEEz99"},{"tag":"fake","text":"Gunfire Heard At Saudi Royal Palace In Riyadh As Rumors Of Attempted Coup Mount https:\/\/t.co\/8KD1sb3hQv"},{"tag":"fake","text":"Loujain al-Hathloul:  She Wanted to Drive, So #SaudiArabia’s Ruler Imprisoned and Tortured Her https:\/\/t.co\/SoMFM8V9kP"},{"tag":"real","text":"TRENDS President Dr. @AhmedAlHamli concludes a productive meeting with the #Saudi National Center for Social Studies @NCSSKSA‘s, General Manager Prof. Sami Abdulaziz AlDamigh, earlier today in #Abu_Dhabi where mutual social development interest were discussed. https:\/\/t.co\/PmaCSsePqC"},{"tag":"real","text":"Saudi Crown Prince Mohammed bin Salman plans to launch a $425 billion infrastructure plan on Monday https:\/\/t.co\/KNrTOf4Zmf via @markets"},{"tag":"real","text":"Abdullah and #Khashoggi both worked for #Qatar undercover. Nonetheless, Abdullah went beyond that and he clearly supports Houthi's act in Yemen.\n#WashingtonPost https:\/\/t.co\/dTUg1GzdCB"},{"tag":"fake","text":"#Saudi Analyst: Saudis Prefer to Work with #Israelis over #Palestinians https:\/\/t.co\/vV3EN0Awwn"},{"tag":"real","text":"#Saudi Contractors Authority to showcase $53-billion #construction projects at #Riyadh event in 2019 🇸🇦 | @SCA2030 |  #منتدى_المشاريع_المستقبلية https:\/\/t.co\/y2FaFeuKXs"},{"tag":"real","text":"King's Cup Final 2018 ceremony organized and covered by #Alamiya_media in collaboration with #Saudi General Sport Authority. https:\/\/t.co\/3GWsOej3z5"},{"tag":"real","text":"ALEPPO, SYRIA King Salman Humanitarian Aid and Relief Centre (KSrelief) recently distributed winter clothing items to children in a number of schools in Mount Simeon.\n@washingtonpost @WSJ @nytimes @nytimesworld @thetimes @Independent @guardian https:\/\/t.co\/vnDdHIXEJJ"},{"tag":"real","text":"#Saudi teenager who fled family and sought asylum when she arrived in #Thailand will leave Bangkok for #Canada Friday, Thai official says \n\n#MNA #MNA_English #Anglophones https:\/\/t.co\/afkDTtttH4"},{"tag":"fake","text":"Really, does @MariahCarey need the dirty #Saudi money so much??? #BoycottSaudi #RememberYemeniChildren #SaveourSaudiSisters @FreeLoujain @DfromCs You can boycott Saudi Arabia and make a LOUD statement, Mariah Carey.  What will you CHOOSE? https:\/\/t.co\/IJuVP2EYkB"},{"tag":"fake","text":"What #Saudi is doing of killing, Blockade, Famine,closing of Civil Airports shame in the forehead of International Socity .   https:\/\/t.co\/rzzvOQ5Ejq #EndYemenSiege"},{"tag":"fake","text":"Activists are calling on Mariah Carey to cancel her upcoming performance in Saudi Arabia over the Kingdom’s alleged human rights abuses and jailing of women’s rights advocates https:\/\/t.co\/EuqKVD23Xz"},{"tag":"fake","text":"The point from the onset is interventionists are using the faux concern for human rights in Venezuela — a mere talking point, to push for regime change. All while silent on US support for Saudi Arabia bombing Yemen back to the Stone Age. But no calls to stop the carnage there..."},{"tag":"real","text":"King Fahd University of Petroleum and Minerals position as #SaudiArabia's top engineering university is shown through its architecture and beauty. With one of the most beautiful campuses in the country, KFUPM is a prime destination for the best #Saudi minds! #KSA https:\/\/t.co\/Q81oqjh5ZO"},{"tag":"real","text":"#Saudi Cabinet restructuring meant to upgrade the standard of services: @KingSalman — https:\/\/t.co\/Z0q38GMRzN https:\/\/t.co\/p2bk6JaxwG"},{"tag":"real","text":"#Saudi| Crown Prince Mohammed bin Salman inaugurates the National Industrial Development and Logistics Program https:\/\/t.co\/JncN3HvxGI"},{"tag":"fake","text":"It's all about that CASH!!! Mariah Carey performs in Saudi Arabia despite calls for boycott over human rights concerns https:\/\/t.co\/fnA54j7KoP"},{"tag":"real","text":"The dynamics of #US shale #oil production is spread across so many operators it is a challenge to engage and predict, but it is a reality, #Saudi Al-Falih tells #ACEnergyForum https:\/\/t.co\/bH6iqiOnRU"},{"tag":"real","text":"This is the approved design for the development project of the roundabout intersecting King Salman and Prince Hammoud roads in #AlKhobar https:\/\/t.co\/lKFlq9nTUp"},{"tag":"fake","text":"this is politically incorrect-but I can't help wondering what happened to our national outrage over Khashoggi's murder? are we as vacuous and fickle as the news cycle?? @davidaxelrod @DanRather @JohnWDean @DrDenaGrayson #Trump #Khashoggi #KremlinAnnex #NorthamMustResign https:\/\/t.co\/1Zv2sYKcOV"},{"tag":"fake","text":"Another stunner from @IgnatiusPost. Saudi Royal Court advisor Qahtani was implicated in #Khashoggi's murder but it's business as usual behind the scenes https:\/\/t.co\/tfxWGKcFcA https:\/\/t.co\/9QYzkkpx6i"},{"tag":"fake","text":"Way to Go @Netflix. #Holocaust next? #SaudiArabia made @Netflix delete a comedy show that accused it of covering up Jamal #Khashoggi murder to protect its crown prince https:\/\/t.co\/JCvTbecrAS via @businessinsider"},{"tag":"real","text":"#Saudi Arabia will maintain longterm commitment to sustain idle #oil capacity to meet any unexpected demand requirements, Al Falih tells #ACEnergyForum #OOTT #OPEC @gulf_intel https:\/\/t.co\/Ey5ev0WOYl"},{"tag":"real","text":"Breaking: Saudi official confirms the news about the shooting at the King's Palace is incorrect and it's just rumor… https:\/\/t.co\/xQqc8i4YQ9"},{"tag":"fake","text":"At Long Last, End the War on #Yemen -- And stop arming #Saudi Arabia -- Take Action with @Roots_Action https:\/\/t.co\/bKxXtMEHvt https:\/\/t.co\/p50iE5hJnA #SuperBowl #JordanPeele #TheTwilightZone #SBLIII #HalftimeShow #HalftimeHeat"},{"tag":"real","text":"A giant entertainment complex complete with #Cinemas , live performance venues and sports facilities will be built in #Riyadh, #SaudiArabia, @EntertainKSA announced Wednesday.\n\nhttps:\/\/t.co\/piJx4O8ntA https:\/\/t.co\/3xEwxF1ssa"},{"tag":"real","text":"THE three decades ban on cinemas in Saudi Arabia was lifted in December 2017. It has been a year, but this positive step by Saudi government is still attracting a lot of attention from global media outlets. https:\/\/t.co\/P8Ofx6Dw3u"},{"tag":"real","text":"#Netfilx pulled an episode of the comedy show “Patriot Act with #Hasan Minhaj” from its Internet #streaming service in #Saudi Arabia after kingdom officials complained, multiple media outlets reported #Tuesday .\n\n#MNA_English #MNA #Anglophones https:\/\/t.co\/7vIDyKPiNo"},{"tag":"fake","text":"Given he did kidnap him last time, this isn’t actually funny https:\/\/t.co\/upZMzkAJNA"},{"tag":"fake","text":"#WashingtonPost used its media platform to facilitate #Khashoggi 's mission of working for #Qatar interests"},{"tag":"fake","text":"@LACaldwellDC @SenMajLdr I would like to declare a National Emergency that Jared Kushner is still out there walking around free ..\n\n#Khashoggi"},{"tag":"fake","text":"INCREDIBLY heavy gunfire now in #Riyadh. \n\nhttps:\/\/t.co\/J4X35HMLLX"},{"tag":"fake","text":"EA on @AJEnglish's Inside Story: Will US Step Away from #Saudi Arabia Over #Yemen? (@ScottLucas_EA, @AdamMBaron, @ShakdamC) \n\nhttps:\/\/t.co\/Glt6bSySdI  https:\/\/t.co\/IkkLxep32s"},{"tag":"real","text":"Saudi Crown Prince Mohammed bin Salman plans to launch a $425 billion infrastructure plan on Monday https:\/\/t.co\/f3byHD3QVz vía @markets"},{"tag":"real","text":"#Pakistani students can gain admission at all #Saudi universities in any subject of their choice. A total of 250 students would be selected for scholarships and the remainder would be selected next year https:\/\/t.co\/quV2XVwp3A https:\/\/t.co\/IGUa5jOu1e"},{"tag":"real","text":"Since October 2018 #SaudiArabia sent 8 requests to #Turkey asking for evidence regarding #Khashoggi incident and received nothing! If Turkey seeks justice they should cooperate. https:\/\/t.co\/ge2BbfCYr3"},{"tag":"fake","text":"MBS is running Saudi Arabia like a man who got away with murder.  #saudiarabia #mbs https:\/\/t.co\/C50X0Ov7qJ"},{"tag":"fake","text":"#PopeFrancis will be the first #pontiff to visit the #Arabian peninsula, the birthplace of #Islam, when he celebrates mass this week in front of an expected 120,000 people in #AbuDhabi !\n\nbut... \n\nthe #UAE is a member of the #Saudi-led 'bloody' coalition in the war in #Yemen !"},{"tag":"real","text":"#Saudi Arabia’s Prince Khaled reveals winners of the 2019 King Faisal Prize - https:\/\/t.co\/28oibDTWA7"},{"tag":"real","text":"#Thailand halts plan to expel #Saudi woman fleeing family.\nhttps:\/\/t.co\/KJ1cS11Q2W"},{"tag":"fake","text":"Saudi women activists are being held in jail, tortured and threatened with rape. Join the call to celebrities like Jay-Z, Trevor Noah, and more to join the cultural boycott of Saudi Arabia, and bring an end to this crazy crackdown on human rights! https:\/\/t.co\/pEi3zAJWfn"},{"tag":"fake","text":"Paul Casey has revealed he has turned down the opportunity to play in the European Tour’s inaugural event in Saudi Arabia this week because of HUMAN RIGHTS VIOLATIONS. When will US, UK stop supplying arms to the kingdom because of HUMAN RIGHTS VIOLATIONS?\nhttps:\/\/t.co\/7oPrEGaXeY https:\/\/t.co\/JB1EkE0csM"},{"tag":"real","text":"Manchester United’s Avram Glazer is set to visit Saudi Arabia next month as part of previous business with the Saud… https:\/\/t.co\/gU4fdE4OpI"},{"tag":"real","text":"#AsianCup2019 : #Saudi Arabia storm into Round of 16 with 2-0 win over #Lebanon https:\/\/t.co\/FG5IoLEtmo"},{"tag":"real","text":"2019 will be a milestone year in #NEOM’s journey, via @Saudi_Gazette (pic: #KlausKleinfeld, Adviser to the #Saudi gov't)\nhttps:\/\/t.co\/rcTy0pVCoW\n#CTW19 #KSA #SaudiArabia #Vision2030 https:\/\/t.co\/ZYro010fI9"},{"tag":"fake","text":"#Yemen children appeal world conscience to stop the coalition led by #Saudi to embargo kills them on #Yemen ."},{"tag":"real","text":"250 #Caves Were Discovered In #Saudi And They'll Soon Be Open To #Tourists Following A Major Revamp\nhttps:\/\/t.co\/KWpMwKaeKd https:\/\/t.co\/cm4BS41yXm"},{"tag":"fake","text":"Mohammed bin Salman Is Running Saudi Arabia Like a Man Who Got Away With Murder https:\/\/t.co\/i7AGdELYRo via @theintercept https:\/\/t.co\/qWRCS253ek"},{"tag":"fake","text":"4\/+\nTo reward @MBuhari for the murder of more than one thousand innocent children, women and men in Zaria, the savage Saudi king Salman opened the Door of the Ka'aba for him and the illiterate Buhari stupidly thought it was the gate of Heaven that was opened. @IntlCrimCourt https:\/\/t.co\/ZB9FMIyPRL"},{"tag":"real","text":"Saudi Market Daily Report 02\/01\/2019\nhttps:\/\/t.co\/aRZQtUMDCs \n#Tadawul #Tasi #KSA #Saudi https:\/\/t.co\/54RErdNPQr"},{"tag":"fake","text":"Was glued to my desk\/PC for most part of the arvo @ work watching the #saverahaf saga unfold 😔 \n\n18yo @rahaf84427714 faces danger if sent bk 2her #Saudi family. Now being held against her will in #Bangkok, #Thai authorities are blocking #UNHCR from assessing her asylum request. https:\/\/t.co\/1HFmE0ZJPH"},{"tag":"real","text":"The #Saudi #HumanRights Commission attended the first session held by the criminal court to sue the indicted by the general prosecution in the murder of late citizen #JamalKhashoggi\n\nhttps:\/\/t.co\/0T5jOTiqa9"},{"tag":"real","text":"There’s no doubt that #Khashoggi was an agent for Qatar how the Washington Post allow him to write, they are a fake media!!\n#حقيقة_عمر_عبدالعزيز_وخاشقجي\n#Qatar"},{"tag":"fake","text":"Rumors claim that King Salman bin Abdelaziz Al #Saoud would be very ill and even possibly dying. #SaudiArabia https:\/\/t.co\/N41e2bYddn"},{"tag":"real","text":"#Saudi Prince #KhalidbinSalman (@kbsalsaud) posted a series of tweets on Thursday discussing #Houthis’ recruitment of children in #Yemen\n\nhttps:\/\/t.co\/29eA1DnwAM"},{"tag":"real","text":"King Salman approves steps to improve health care in KSA https:\/\/t.co\/BwGjeq5yGD https:\/\/t.co\/yLwx9QchbZ"},{"tag":"real","text":"#Saudi women to start receiving divorce notice by text message https:\/\/t.co\/zwiov6g3FP"},{"tag":"real","text":"The #Saudi ambassador to #Yemen has accused some #UN organizations of silence regarding crimes and violations by #Houthi militias, including stealing and hindering the distribution of humanitarian aid to the #Yemeni people https:\/\/t.co\/8jtH8uEZkN https:\/\/t.co\/Fj1GBBSDwR"},{"tag":"fake","text":"#WashingtonPost tried to extricate itself from the crisis by saying that it had no knowledge of #Khashoggi's relationship with #Qatar, noting that contacts with Qatar were known, indicating that Khashoggi's attacks on #Trump &amp; #Saudi were in line with their narrative of events. https:\/\/t.co\/NGOfstlW1y"},{"tag":"real","text":"#BREAKING--#Saudi woman at Bangkok airport will not be forcibly deported: Thai official. \n\n#MNA #MNA_English #Anglophones https:\/\/t.co\/eln4PJDzl8"},{"tag":"fake","text":"Saudi women activists are being held in jail, tortured and threatened with rape. Join the call to celebrities like Jay-Z, Trevor Noah, and more to join the cultural boycott of Saudi Arabia, and bring an end to this crazy crackdown on human rights! https:\/\/t.co\/AIjcnqDgGq"},{"tag":"fake","text":"The horrible death of Tala and Rotana happened only 6 weeks before #Khashoggi.\nI have great doubts that MBS is behi… https:\/\/t.co\/W86iaR6MIT"},{"tag":"fake","text":"\"Guardianship gives men ultimate authority over women. He can control her, slap her, beat her, do whatever he wants and no one can stop him. This is causing women to dream about living elsewhere, away from where they were born and raised\" #Saudi #SaveRahaf https:\/\/t.co\/8xo9GKM1MA"},{"tag":"real","text":"@AlJanadriaFest |#SDRPY Supervisor, #Saudi Amb. to #Yemen Mohamed AlJabir: There are major obstacles that confront the achievement of development in #Yemen so we created a strategy to overcome these challenges in order to provide a safe and stable environment for Yemen. https:\/\/t.co\/U58MlSO1HU"},{"tag":"real","text":"#STATEMENT | The Public Prosecutor: The initial hearing for the (11) individuals indicted in the case of the murder of Jamal #Khashoggi was held in the Criminal Court of #Riyadh https:\/\/t.co\/HequkX76P8"},{"tag":"fake","text":"@KarenAttiah Karen\nYou do not understand Saudi Arabia bigger than your dirty mind\nThere are 30 million Saudi Muslims standing with King Salman and Prince Mohammed bin Salman\nSo do not try"},{"tag":"real","text":"The Saudi prosecution held first hearing to trial 11 accused In a murder #Khashoggi , The prosecution demanded from Turkey response and send the evidences it claims to possess. \n\nTurkey has not responded to the Saudi government despite repeated claims that it has evidence. https:\/\/t.co\/Yv6GjHs94s"},{"tag":"fake","text":"Britain's armed forces have an enviable reputation – we should not cheapen it by playing wargames with the Saudis | @NiaGriffithMP https:\/\/t.co\/3sDhqaHWmn"},{"tag":"real","text":"#Digitisation contract signed in #SaudiArabia for Two Holy Mosques 🇸🇦  | #Saudi #facman #smartcities https:\/\/t.co\/iNpah2G3xf"},{"tag":"fake","text":"Mariah Carey performs in Saudi Arabia despite calls for boycott over human rights concerns https:\/\/t.co\/vZlcLEDjVH"},{"tag":"real","text":"Mediation reports issued by Amicable Settlement Departments of labor offices are now recognized as “enforceable documents” that can be directly filed to the enforcement judiciary, revealed the #Saudi Ministry of Justice (MoJ).\n\nhttps:\/\/t.co\/jjCKHU4ur4"},{"tag":"real","text":"According to Mike Knights' new report, the #Houthi-s have constructed 100 new barriers and dug 50 new trenches in direct contravention of the #Stockholm ceasefire agreements, while targeting #Saudi-led coalition rubble-clearing vehicles. Must read. \n\nhttps:\/\/t.co\/jacW9weBD6"},{"tag":"fake","text":"In which ⁦@NickKristof⁩ calls for Congress to take action to help detained #Saudi women’s rights activists and proposes one of them, who has reportedly been water boarded in prison, to receive the Nobel Peace Prize https:\/\/t.co\/UHTNfuSQJF"},{"tag":"real","text":"#Saudi prosecutor seeks death penalties in #KhashoggiMurder case #JamalKashoggi https:\/\/t.co\/KkNgAQHgUL"},{"tag":"fake","text":"🔴Breaking News\n#Saudi authorities release Sheikh Badr bin Ali al-Otibi after 9 months of arbitrary detention because of a tweet in which he expressed his opinion about \"wrestling\", at a time when the General Authority for Entertainment was trying to Promote it in KSA! https:\/\/t.co\/Rklm9Lgzwu"},{"tag":"real","text":"🔴 Saudi Attorney general announces the Public Prosecution account\nFirst hearing of the five defendants killed #Khashoggi\nDemanding their execution\nHe also officially asked #Turkey for the fourth time to send the recordings and documents\nWhich #Erdogan refuses to hand over⁉️ https:\/\/t.co\/KpzWl3Kw3M"},{"tag":"real","text":"Police are investigating the deaths of Saudi sisters, Rotana and Tala Farea, whose bodies were found in New York la… https:\/\/t.co\/Y2IVmT1bGJ"},{"tag":"fake","text":"The #Saudi - led coalition blockade causes  death of more than 30,000 patients who needed to travel,  https:\/\/t.co\/ZC90XTEZRo #EndYemenSiege"},{"tag":"real","text":"#Saudi prosecutor seeks death sentences as #Khashoggi murder trial opens\n\n#MNA_English \n#MNA \n#Anglophones https:\/\/t.co\/uagnqEqyr8"},{"tag":"real","text":"Despite the Machiavellian explanations some Western reporters would have you believe, #Saudi-s are building schools and hospitals in #Yemen because Saudis\/Yemenis are joined by an unbreakable bond of brotherhood rooted in a common faith, language and culture. 🇾🇪🇸🇦🇾🇪🇸🇦"},{"tag":"fake","text":"#Netflix pulls ‘#PatriotAct’ #episode in #SaudiArabia after it #criticized #official #account of #Khashoggi #killing \n\nContinue reading at https:\/\/t.co\/BTFrzbH1DE | #Gulflance"},{"tag":"real","text":"$40-million plant producing solar cell raw material launched in #Saudi Arabia ☀🇸🇦 | #SaudiArabia #solarenergy https:\/\/t.co\/wusVQdVWVY"},{"tag":"fake","text":"The #Saudi violated the laws and customs by the ongoing  #Saudi closing of Sana'a Airport and destroying of Civil Airports https:\/\/t.co\/U8h4pp7Q2e"},{"tag":"fake","text":"Confirms New Details of Torture of #Saudi Women Activists as British MPs Seek Access to Prisons to Investigate https:\/\/t.co\/ReCDg5onn1 #mbs https:\/\/t.co\/cfG2TIf6UP"},{"tag":"fake","text":"Mohammed bin Salman Is Running Saudi Arabia Like a Man Who Got Away With Murder - \n\nSaudi Crown Prince Mohammed bin Salman arrives to meet with British Prime Minister Theresa May in London, England, on March 7, 2018.\nPhoto: Dan Kitwood \/Getty Images\nLast week, Saudi Arabia’s G... https:\/\/t.co\/j3N3MvrpRL"},{"tag":"real","text":"#Aramco reveals new life in old fields  https:\/\/t.co\/yVzyXJrBnx #OOTT #saudi"},{"tag":"fake","text":"In #Khashoggi's apartment in Turkey, bank checks were found from #Qatar. Not surprisingly, it is Qatar that brought Khashoggi to the Washington Post and who pays him for private articles he publishes in his name. https:\/\/t.co\/26GvcTaCXb"},{"tag":"real","text":"#Japan beat #Saudi Arabia 1-0 to enter the #afcasiancup quarterfinals. #AsianCup2019 https:\/\/t.co\/s2cSyQj4Fp"},{"tag":"fake","text":"The so called “Saudi Feminists” like Manal &amp; Lujajn are actually funded by Qatar to paint bad picture of Saudi real reformer , MbS https:\/\/t.co\/Gf2T8CG1IZ"},{"tag":"real","text":"#Qatar has funded the #WashingtonPost &amp; its editors to lead campaigns with a goal of distortion of the #Saudi image to the world &amp; they always get caught with it!."},{"tag":"real","text":"#Saudi developer of Jabal Omar secures $135-million sukuk from #Dubai's Shuaa 🇸🇦🇦🇪 | #construction #realestate https:\/\/t.co\/YnvgRKEbxk"},{"tag":"real","text":"#Saudi Public Prosecution seeks death penalty for 5 as trial for 11 accused in #Khashoggi killing begins https:\/\/t.co\/BF6kaRhkkX"},{"tag":"fake","text":"Oregon Senator @RonWyden asking the important questions #Khashoggi https:\/\/t.co\/J7od6D8Odm"},{"tag":"fake","text":"Remember this name: Loujain (pronounced Loo-JAYNE) al-Hathloul. She is 29 years old and a courageous advocate for gender equality — so she is in a Saudi Arabian prison, and reportedly our Saudi allies have tortured her, even waterboarded her. https:\/\/t.co\/rHur9YIr8s"},{"tag":"real","text":"Oil prices rise as #SaudiArabia cuts supply to United States https:\/\/t.co\/E6Yw4yX3C9\n\n#energy #Saudi #USA #America #oil #gas #oilandgas #subsea #commodities #economics #markets #trading #alxcltd https:\/\/t.co\/zIrRsBs6KD"},{"tag":"real","text":"Crown Prince Mohammed bin Salman said in March that #women only needed to dress modestly and were not required to wear abayas. But #Saudi women say that in practice nothing has changed, and demanded more #freedom. https:\/\/t.co\/5NmTDzPkAx"},{"tag":"fake","text":"Mohammed bin Salman is running Saudi Arabia like a man who got away with murder https:\/\/t.co\/PhizA9cjQy by @SarahAziza1"},{"tag":"fake","text":"What agreement exist between @realDonaldTrump  and Mohammed bin Salman and trump to keep rich Saudis from facing justice for crimes against Americans?\nhttps:\/\/t.co\/wpfNdly9zH"},{"tag":"real","text":"#Saudi, #Japanese experts meet on home appliances energy efficiency\nhttps:\/\/t.co\/plmieITikQ"},{"tag":"real","text":"#Saudi enforcement courts play an important role in enforcing foreign sentences and restoring financial rights. https:\/\/t.co\/Vc059sJtrh"},{"tag":"real","text":"With a river that flows through it all year round, Wadi Al-Bardani is one of #SaudiArabia's most beautiful valleys. Located in #Asir, there are two #Saudi towns that call the valley home: Bin Otyafa and al-Asrat! #KSA https:\/\/t.co\/eeS30N8u7G"},{"tag":"real","text":"Beautiful @Reuters photo from @AlJanadriaFest. #Saudi men fire weapons while performing a traditional dance at the cultural festival https:\/\/t.co\/L3d11m4m7o https:\/\/t.co\/n0KrjjPkSw"},{"tag":"fake","text":"In #Saudi Arabia, when a woman escapes from an abusive home and reports the abuse, her family can counter with a co… https:\/\/t.co\/ZiHqXCpW6I"},{"tag":"real","text":"BREAKING: #Saudi General Prosecution calls for punishment of murderers of #Khashoggi https:\/\/t.co\/lW8oPATEzO"},{"tag":"fake","text":"I’m glad that Mohammed Al-Amoudi is now free after facing ridiculous charges by #SaudiArabia’s Crown Prince Mohammed bin Salman. This is good news for #Ethiopia, #Sweden, and other countries where Mohammed’s businesses dominate. Thank you, @PMEthiopia. https:\/\/t.co\/SwjXSs2amk"},{"tag":"fake","text":"Fearless Australian TV host says UN is useless pro-Islamic organization, dominated by worst human rights violators (Iran, Saudi Arabia, Pakistan...) https:\/\/t.co\/7pj4hXR5Mh"},{"tag":"real","text":"UAE support for Saudi Arabia’s war in Yemen and its problematic record on human rights and labor violations at home will likely will get a pass from the Pope.\nhttps:\/\/t.co\/yZUHhYYpwJ"},{"tag":"fake","text":"Mohammed bin Salman Is Running Saudi Arabia Like a Man Who Got Away With Murder https:\/\/t.co\/uxbx7Zpa0N"},{"tag":"fake","text":"https:\/\/t.co\/KqnNI7LeHh\nSaudi King Salman very ill, in ICU.\nSaudi Arabia's King Salman bin Abdulaziz Al Saud is rep… https:\/\/t.co\/U41iG02iLL"},{"tag":"real","text":"King Salman receives outgoing Kuwaiti ambassador https:\/\/t.co\/ydDTX9qtnO https:\/\/t.co\/S85R9X18NE"},{"tag":"real","text":"@PressTV @UN liars!! #Saudi-led coalition is committed to the ceasefire agreement and didn’t launch any air strikes since they agreed."},{"tag":"real","text":"Saudi Arabia Total Oil Reserves Revised to 266.1 Billion Barrels vs. 264 Billion Barrels #OPEC #OOTT #Saudi"},{"tag":"fake","text":"The #Saudi targeting civil airports considers great violation for International Laws , and imposing a Blockade regards a war crime https:\/\/t.co\/NwVHViiQ1e #EndYemenSiege"},{"tag":"real","text":"#Saudi Ministry of Commerce and Investment (⁦@SaudiMCI⁩) has announced the names of 41 men and women who have applied for #jobs through the ministry's website. https:\/\/t.co\/v4lKn5K9qm"},{"tag":"real","text":"A THROWBACK #Video Shows A Proud #KingSalman Lauding His #Son Prince Sultan On His First #Space #Trip\n#الهيئة_السعودية_للفضاء \n#الأمير_سلطان_بن_سلمان\nhttps:\/\/t.co\/qDFfPBc20Y https:\/\/t.co\/oBlAVylhNU"},{"tag":"real","text":"#NewBlogPost Five Saudi cities have replaced 200,000 lamps to light their streets with the aim of reducing energy consumption by 77%.\n\nRead more: https:\/\/t.co\/REFJSSKCj7\n\n#materials #products #dubai #tenders #procurement #business #saudi https:\/\/t.co\/keLP1ljceH"},{"tag":"fake","text":"Saudi women activists are being held in jail, tortured and threatened with rape. Join the call to celebrities like Jay-Z, Trevor Noah, and more to join the cultural boycott of Saudi Arabia, and bring an end to this crazy crackdown on human rights! https:\/\/t.co\/fbR8UAUtD6"},{"tag":"real","text":"#Saudi security operation kills two in #Qatif https:\/\/t.co\/plRDR75OG8"},{"tag":"fake","text":"“Under male #guardianship laws, #Saudi women face systematic discrimination and are left exposed to domestic violence. With few places to turn, some undertake dangerous escape attempts to flee the country“ writes Human Rights Watch \/\/ #WomensRights https:\/\/t.co\/7nzUXDi4oX"},{"tag":"real","text":"'The Kingdom has made tremendous accomplishments in the domain of “human rights.” This conforms to the great keenness of the Kingdom’s leadership to protect human rights.'\n\n[And compares critics to Joseph Goebbels] \n\nhttps:\/\/t.co\/WZwUl2Ws6E"},{"tag":"real","text":"A 14-year-old student has become the youngest #Saudi to climb Mount #Kilimanjaro in northeast #Tanzania, the world’s fourth-highest peak. #Mountaineer #climbing #SaudiArabia #adventure \n\nhttps:\/\/t.co\/l3FTC2Y1rw"},{"tag":"fake","text":"Rotana Farea was 22; Tala Farea was 16. They had requested asylum in the United States. The Clown Prince Mohammad B… https:\/\/t.co\/PZyobLmoqk"},{"tag":"real","text":"Meet rising #Saudi model #TaleedahTamer who, at 18, has her sights set on global success. Don't miss our interview in today's issue and here https:\/\/t.co\/SgHH9fU3nP #TabloidCover https:\/\/t.co\/GaXy4lqZc1"},{"tag":"real","text":"BREAKING: #Saudi General Prosecution says interrogation of a number of accused continues in #JamalKhashoggi killing https:\/\/t.co\/N649M6PQHw"},{"tag":"fake","text":"EXPLOSIVE!!\n\nJournalist who interviewed Lebanese prime minister Hariri in Riyadh confirms he was kidnapped and unde… https:\/\/t.co\/ZUk2fcsYni"},{"tag":"real","text":"The future of #Cybersecurity was highlighted at @SNSRExpo 2018 as a key pillar. In partnership with industry leaders such as @Odyssey, #FeedbackItalia and @thalesgroup , we aim towards further growth in 2019. Shape the #Cybersecurity landscape in #Saudi https:\/\/t.co\/bDhdmuAtXy https:\/\/t.co\/JwgrN4ZFtn"},{"tag":"real","text":"Announcement of launching “Mohammed bin Salman’s Sanad Program\".\n\nDesigned to develop the social &amp; non-profit initiatives concerning Saudi citizens empowerment. Setting a framework for His Royal Highness charitable activities &amp; categorising them for effective development.\n\n#MbS https:\/\/t.co\/8bHYS39gt3"},{"tag":"real","text":"#MohammedbinSalman paid a historic visit to the #US, which took 3 weeks. #MBS met with the US President at the #WhiteHouse. During the meeting, bilateral relations &amp; arms deals were discussed. #CrownPrince also visitted Harvard,MIT, Pyeong, Silicon Valley, and Aramco Laboratories https:\/\/t.co\/Zmhg6wdB8p"},{"tag":"real","text":"Its architecture makes it stand out among the countless towers in #Jeddah, the Jeddah Islamic Developmental Bank utilizes original architectural design that makes it a wonderful landmark in the city! #KSA #SaudiArabia #Saudi https:\/\/t.co\/wYy9O8IMPY"},{"tag":"fake","text":"🇬🇧| The clashes between the Saudi security forces and an organized and heavily armed group in the royal palace in R… https:\/\/t.co\/vvHRiJUTVh"},{"tag":"real","text":"Five factors fueling the oil market in 2018\n\n#ArabNews #OPEC #Oil #GIQ\n#Saudi #Aramco #Saudi_Aramco\n#CrudeOil #OOTT #CrudeOil \n#OilandGas #SPAGOV\n#Faisal_Mrza\n\n@ArabNews\n\nhttps:\/\/t.co\/8Az5H6WUQB"},{"tag":"real","text":"New video shows massive #Houthi missile attack on southern #Saudi Arabia https:\/\/t.co\/9CbbeZedO8  #Asir #Yemen"},{"tag":"real","text":"#Aramco signs 10 agreements with local and international companies to rent 3.35 million m2 at King Salman Energy City #Spark https:\/\/t.co\/uzyjX4Kgg2"},{"tag":"real","text":"$40-million plant producing solar cell raw material launched in #Saudi Arabia ☀🇸🇦 | #SaudiArabia #solarenergy https:\/\/t.co\/16758p8EhZ"},{"tag":"real","text":"#Saudi Arabia’s Presidency of State Security announced on Wednesday that they carried out a preemptive operation that killed six wanted persons and the arrest of one in the eastern city of #Qatif \n\nhttps:\/\/t.co\/3Op5J89yMP"},{"tag":"fake","text":"#Saudi by closing Sana'a Airports , make Civilians targets for its missils   #EndYemenSiege"},{"tag":"real","text":"#Saudi minister says kingdom is under attack by the enemies of Islam, calls for unity “until we are able to rid the country of the evil people\"  https:\/\/t.co\/0F8a1FpXmx"},{"tag":"real","text":"NEOM tops Saudi Arabia's 2018 megaprojects . Expand your horizons with Ziwo Cloud Call Center https:\/\/t.co\/Znf9Zc26DG https:\/\/t.co\/e2Qv2mzZhO \n #saudi #KSA #middleeast #saudiarabia #investments #business #venture #startup #entrepreneurship #expansion #future #gulf #GCC #success"},{"tag":"real","text":"#Saudi teen flies to #asylum in #Canada\nPrime minister grants #UN request to accept #RahafMohammedalQunun \n\n#MNA_English \n#MNA\n#Anglophones https:\/\/t.co\/UMEnSBdapi"},{"tag":"fake","text":"Mohammed bin Salman Is Running Saudi Arabia Like a Man Who Got Away With Murder\n\nhttps:\/\/t.co\/QU1U6RIVGg"},{"tag":"real","text":"#SaudiArabia’s #KingSalman bin Abdulaziz Al Saud has sent a written message to Sheikh Sabah Al-Ahmed Al-Jaber Al-Sabah, Emir of #Kuwait \n\nhttps:\/\/t.co\/YJh1AdXuxL"},{"tag":"real","text":"$40-million plant producing solar cell raw material launched in #Saudi Arabia ☀🇸🇦 | #SaudiArabia #solarenergy https:\/\/t.co\/baGn4vOYYJ"},{"tag":"real","text":"The #Saudi government reportedly complained to @NetflixMENA that the episode on @hasanminhaj's @patriotact show violated the kingdom's anti-cyber crime law. #SaudiArabia #HasanMinhaj https:\/\/t.co\/IYBfDSh2rK https:\/\/t.co\/lzviFyCWX4"},{"tag":"fake","text":"On the Front Line of the #Saudi War in #Yemen ? Child Soldiers from #Darfur - The New York Times\n#Sudan  https:\/\/t.co\/ckFe0TVHGN"},{"tag":"real","text":"#Erdogan is releasing information in a very controlled way in regards to #Khashoggi and #Saudi - regularly pointing towards #MBS. Saudi has not faced this exposure for a long while. Vultures are circulating #Riyadh for sure. https:\/\/t.co\/ws3NL3yJCw"},{"tag":"real","text":"The #Saudi Development and Reconstruction Program for #Yemen distributed 192,000 schoolbooks to children in #Yemen 🇾🇪 https:\/\/t.co\/Wgsz73aiEa"},{"tag":"real","text":"#Netflix has removed the episode from #Saudi, however, it's still available on Netflix in the #UAE \n\nhttps:\/\/t.co\/fc0LRYJ0rE"},{"tag":"real","text":"HAMA, SYRIA: King Salman Humanitarian Aid and Relief Centre (KSrelief) team continues to follow up its projects in Syria\n@washingtonpost @WSJ @nytimesworld @nytimes @Independent @thetimes https:\/\/t.co\/FSgXXpB7pJ"},{"tag":"fake","text":"Heavy gunfire reported outside Saudi Royal Palace with rumours of attempted coup: Foreign media https:\/\/t.co\/CW5cf22JNU"},{"tag":"real","text":"King Salman Inaugurates Sustainable Agricultural Rural Development Program https:\/\/t.co\/L0bQGpPzQV"},{"tag":"fake","text":"A mother and her Child …A suffering in Sana'a Airport closed by the #Saudi -led coalition  https:\/\/t.co\/0BBXu0AxsB #EndYemenSiege"},{"tag":"real","text":"If done properly PPP could extract the best out of both the private and public sector, proving the create positive value for money for the Saudi Arabia #PPP #Education #Saudi https:\/\/t.co\/wNdBfeSJVN"},{"tag":"real","text":"From the opening of cinemas in #Saudi Arabia to the arrival of #MeToo in #Egypt, 2018 was a transformative year for media throughout the #Arab world https:\/\/t.co\/HSmLG1vhjm https:\/\/t.co\/HubV2SsV7J"},{"tag":"real","text":"The Red Sea entity is an initiative by King Salman in order to achieve stability in the region. The entity will include Egypt, Sudan, Djibouti, Yemen, Somalia and Jordan.\n\n #كيان_البحر_الاحمر #SaudiArabia https:\/\/t.co\/5AvrdByW7g"},{"tag":"fake","text":"Mohammed bin Salman Is Running Saudi Arabia Like a Man Who Got Away With Murder #SmartNews   #MisterBoneSaw  https:\/\/t.co\/kM2jH3uYoF"},{"tag":"real","text":"Silence of International Community of closing the #Saudi Emirates-led coaltion considers a stain of shame in the forehead of Humanity  https:\/\/t.co\/omblYmHnmk #EndYemenSiege"},{"tag":"fake","text":"Mariah Carey performs in Saudi Arabia despite calls for boycott over human rights concerns | World News https:\/\/t.co\/5eddUR5D7Q https:\/\/t.co\/nXOaxPKC8m"},{"tag":"real","text":"@AJEnglish Correction: The prosecution have asked for the death sentence for 5 of the 11 accused of killing #Khashoggi. The trial is just beginning and according to Saudi law, no names are released until a verdict is found."},{"tag":"real","text":"#NationsPrideImranKhan \nSaudi Crown Prince Mohammed bin Salman is expected to arrive in Pakistan for a brief trip in a few weeks, it is likely that the Kingdom will announce investment package for Pakistan.\n\n🇵🇰🇸🇦 https:\/\/t.co\/uD6mSEbKcM"},{"tag":"real","text":"#Australia's Foreign #Minister Has Flown To #Thailand To Investigate The #Saudi #Woman Seeking #Asylum's Case\nhttps:\/\/t.co\/cZQCD8Jjzm https:\/\/t.co\/cCTTnuDzCL"},{"tag":"real","text":"#BREAKING : #Saudi prosecutor seek death sentences as #Khashoggi murder trial opens\n\n#MNA_English #MNA #Anglophones https:\/\/t.co\/SrD5hTn49Z"},{"tag":"fake","text":"“Producing and distributing content that ridicules, mocks, ... religious values ... through social media...will be… https:\/\/t.co\/yBzYWreEn9"},{"tag":"fake","text":"#Saudi woman held at #Bangkok airport says fears death if repatriated\n\n#MNA_English \n#MNA \n#Anglophones https:\/\/t.co\/3kWB2LxfaM"},{"tag":"real","text":"A #Saudi #Citizen Aged 100 Has Inspired #People After Returning To #School To Complete His #Education\nhttps:\/\/t.co\/lrsNzG0e3w https:\/\/t.co\/8EGYFqSziu"},{"tag":"real","text":"Great news for solar energy. Saudi Arabia is heading in the right path \nread this https:\/\/t.co\/NC6hC4Zrc3\n\n#Energy #saudi #vision2030 #solarenergy #2019"},{"tag":"real","text":"New images have revealed the full extent of a redevelopment of a neighbourhood in eastern #Saudi Arabia once plagued by militants and criminals https:\/\/t.co\/yQiyvwnyyv https:\/\/t.co\/fnM6ctBpTr"},{"tag":"real","text":"Al falih says DNM conducted the audit #OOTT #saudi"},{"tag":"fake","text":"Yemeni Kids are kille by cancer as well as the blockade impossed by the #Saudi -led coalition  https:\/\/t.co\/JlSkypJ0ri #EndYemenSiege"},{"tag":"real","text":"Saudi Arabia’s stock market jumped in early Sunday trade on positive investor sentiment, higher oil prices and solid gains by blue chips, led by Al Rajhi Bank which announced a capital increase, while other markets rose slightly.\n\n#SaudiArabia https:\/\/t.co\/9gMtP2mxJj"},{"tag":"fake","text":"Saud al-Qahtani, a top royal adviser to MbS, was present several times when Loujain was tortured, she said. Sometimes Mr. Qahtani laughed at her, sometimes he threatened to rape and kill her and throw her body into the sewage system."},{"tag":"real","text":"King announces plans to set up Saudi Space Agency https:\/\/t.co\/YXFvWBONtV\n#saudispaceagency #saudi #space"},{"tag":"real","text":"🗓 #Alhilal first football team fixtures of the second round of #MBS_ProLeague https:\/\/t.co\/1X6T170DcN"},{"tag":"real","text":"#SAVIT in #Saudi #Arabia deployed #Microsoft #Project Online, along with #PowerBI for GACA - General Authority of Civil Aviation - Saudi Arabia to automate project management and boost productivity. Abdulmajeed Alobailan https:\/\/t.co\/vLPy94uPKx"},{"tag":"real","text":"#Saudi Ambassador to #Yemen, Mohammed bin Saeed Al-Jaber, told The Associated Press @AP that at least 60 percent of the funds sent to the #UN by members of the Saudi-led coalition have not yet been spent on their intended purpose."},{"tag":"real","text":"A beautiful landscape in #SaudiArabia, Tuwaiq Mountains West of #Riyadh have been mentioned by Crown Prince Mohammed Bin Salman as a representation and symbol of the incredible #Saudi strength! https:\/\/t.co\/kPq6170nBg"},{"tag":"real","text":"@KingSalman launches new initiative to empower small income groups https:\/\/t.co\/kRQxIimPYj #SaudiRoyalFamily #KSA https:\/\/t.co\/7QyFEHI5NJ"},{"tag":"fake","text":"The #Saudi-led coalition stopped Civil and Huamn flights and aggravates the suffering of Yemeni people outside and inside https:\/\/t.co\/oJ4xsjaKhd"},{"tag":"real","text":"#Rodrigues moving from Galatasaray to #Saudi club\nFootballer played 20 matches and scored 4 goals this season in Galatasaray\n\n#MNA_English\n#MNA \n#Anglophones https:\/\/t.co\/P5C4yrX5WB"},{"tag":"real","text":"#Krahenbuhl had signed an agreement with #Abdullah binAbdulazizAlRabeeah, Supervisor General of the King \n#Salman Humanitarian Aid and Relief Center, in support of #UNRWA’s core health, education and social services in 2018. \n\n#MNA #MNA_English #Anglophones #UNRWA https:\/\/t.co\/jAWOiNNK9l"},{"tag":"fake","text":"Yemeni doctor message : the Blockade kills Children as a reason of closing Sanaa Airport by #Saudi https:\/\/t.co\/SI7sl4fM82 #EndYemenSiege"},{"tag":"real","text":"#Saudi woman gives birth, loses husband at the same time https:\/\/t.co\/h0Jd9wWF9b"},{"tag":"real","text":"Charge d’Affaires of the #Saudi Embassy in #Bangkok, Abdul-Ella Shuaibi has confirmed that a Saudi girl who was with her father in #Kuwait has managed to flee to #Bangkok:\n\nhttps:\/\/t.co\/uXHdkT1bt5"},{"tag":"real","text":"#Saudi Arabia unveils #Riyadh's first entertainment complex spanning 10-hectares 🇸🇦🎡 | #SaudiArabia #construction #tourism https:\/\/t.co\/zKuLrGmtIR"},{"tag":"real","text":"#Saudi Contractors Authority to showcase $53-billion #construction projects at #Riyadh event in 2019 🇸🇦 | @SCA2030 |  #منتدى_المشاريع_المستقبلية https:\/\/t.co\/YJJB2DeORU"},{"tag":"real","text":":: King Salman swore in the new Cabinet ministers at Al-Yamamah Palace in Riyadh on Tuesday. The ministers included Prince Turki bin Mohammed bin Fahd as minister of state; Abdullah bin... https:\/\/t.co\/WrAZ5vS77m"},{"tag":"real","text":"Saudi Market Daily Report 08\/01\/2019\nhttps:\/\/t.co\/xpBWz3vhtg \n#Tadawul #Tasi #KSA #Saudi https:\/\/t.co\/AcMCYxDjjx"},{"tag":"real","text":"#Pakistani students can gain admission at all #Saudi universities in any subject of their choice. A total of 250 students would be selected for scholarships and the remainder would be picked next year. https:\/\/t.co\/quV2XVwp3A https:\/\/t.co\/GewbaSwdZ8"},{"tag":"real","text":"The #Khashoggi articles on the #Washingtonpost was written by the #Qataris through Maggie Salem, the executive director of #Qatar foundation international https:\/\/t.co\/9r3oarpMNi"},{"tag":"real","text":"#SaudiArabia's Crown Prince has directed the launching of the program ‘SNAD Mohammed bin Salman’ as part of his efforts to develop the fields of non-profit social initiatives aimed at empowering Saudi citizens and help them attain a stable life.\n\nhttps:\/\/t.co\/aQgS589YRu"},{"tag":"real","text":"An 18-year-old #Saudi woman who fled her family saying she feared for her life has been granted asylum in #Canada, #Canadian Prime Minister #JustinTrudeau said on Friday, as Thai officials confirmed the teen was en route to #Toronto.\n\n#MNA_English\n#MNA\n#Anglophones https:\/\/t.co\/sV3HxlyHMy"},{"tag":"fake","text":"Coalition led by #Saudi destroyed civil institutions for instance, civil airports are destroyed."},{"tag":"real","text":"#Saudi Arabia to set up $10 billion oil refinery in #Pakistan https:\/\/t.co\/aK0dryQhcq"},{"tag":"real","text":"King Salman approves steps to improve health care in KSA - https:\/\/t.co\/BwGjeq5yGD - https:\/\/t.co\/utXrEGfTyY - RiyadhVision https:\/\/t.co\/K6OCpArFZG"},{"tag":"real","text":"Dr. Saad Al-Kasabi, Governor of the #Saudi Standards, Metrology &amp; Quality Organization (@SASOGOV) received #Switzerland's Ambassador Dr. André Schaller &amp; his accompanying delegation. During the meeting, the two sides discussed cooperation &amp; a number of issues of mutual interest https:\/\/t.co\/ENzp7gRKN0"},{"tag":"real","text":"Doubling down on lies to placate your hardcore nationalist supporters in the face of mounting local opposition is the sort of thing Crown Prince Mohammed bin Salman is famous for. Which reminds me of that time you met Crown Prince Mohammed bin Salman: https:\/\/t.co\/kWYmP5Q7dt https:\/\/t.co\/qZIUXLpjwz"},{"tag":"real","text":"#State-run #Saudi #Aramco has set its #January contract price for propane at $430 a tonne, the company said on #Monday .\n\n#MNA_English\n#MNA #Anglophones https:\/\/t.co\/07ELcSHct9"},{"tag":"real","text":"A #Saudi prosecutor has asked for the death penalty for five of 11 suspects held over the murder of #journalist #JamalKhashoggi at the country’s consulate in Istanbul on Oct. 2, the state news agency SPA reported on #Thursday.\n\n#MNA_English\n#MNA #Anglophones https:\/\/t.co\/pSt0MMlmaF"},{"tag":"fake","text":"Watch Saudi Arabia vs North Korea live Stream Today 8\/1\/2019 online AFC Asian Cup Football\n#SaudiaArabia #NorthKorea #Korea #Saudi  #live #Stream \n #AsianCup2019 \n#AFC \n#AsianCup \n#AFCAsianCup2019 https:\/\/t.co\/ELP4dpqVmf"},{"tag":"real","text":"You can now use notarial services in #Saudi Arabia through a mobile app. https:\/\/t.co\/CnsNIIEQMb"},{"tag":"real","text":"Ejar, the real estate rental program under the #Saudi Ministry of Housing (@SaudiHousing), has slapped fines on 41 establishments for violating #rental regulations. https:\/\/t.co\/rDqUCFOWfE"},{"tag":"real","text":"#Saudi Border #Guards Have Seized Hundreds of Kilograms Of #Drugs In A Major Bust\nhttps:\/\/t.co\/sRDndku3jh https:\/\/t.co\/aDf3jbSiZV"},{"tag":"fake","text":"#Saudi men fire weapons as they perform a traditional dance during #Janadriya Cultural Festival on the outskirts of Riyadh.  https:\/\/t.co\/MRwcQTBQmR"},{"tag":"fake","text":"Unconfirmed media reports indicate that #Saudi king Salman is very ill, maybe dying. If true, this event will possi… https:\/\/t.co\/k23CLzee7r"},{"tag":"real","text":"Saudi Market Daily Report 30\/12\/2018\nhttps:\/\/t.co\/loQWl2RLdE  \n#Tadawul #Tasi #KSA #Saudi https:\/\/t.co\/PGQLDPPi1g"},{"tag":"real","text":"Khashoggi murder: Saudi prosecutor absolves MBS of blame and seeks death penalty for five suspects https:\/\/t.co\/vq3hw5lUBV https:\/\/t.co\/TzB40pkq7v"},{"tag":"real","text":"#Alhilal to resume training on Monday evening in preparation for the next match against “Al-Raed” in #MBS_ProLeague https:\/\/t.co\/ZLOGUdGAoq"},{"tag":"real","text":"Young #Saudi doctor honored for tending accident victims on road — https:\/\/t.co\/ypdWYsdeMu #Saudiwoman"},{"tag":"real","text":"In 2018, the #Saudi transport ministry’s Consolidated Communication Center received 2,200 complaints through its app, 22,000 through other portals https:\/\/t.co\/QJO5kyDRHY https:\/\/t.co\/LK6Iw0n3Cu"},{"tag":"real","text":"SoftBank, which has already invested more than $8bn in WeWork, had looked at spending $16bn to buy a larger position in the company. \n\nRead more - https:\/\/t.co\/yjf5DUujSq\n\n#SaudiArabai #KSA #Wework #stakeholders #softbank #saudi #uae #middleeast #news #investments #banking"},{"tag":"fake","text":"#BREAKING: Reports of explosions, heavy gunfire near the royal palace in #Riyadh, Saudi Arabia. Reportedly, the Kin… https:\/\/t.co\/XazKPu2M9L"},{"tag":"fake","text":"Mariah Carey performs in Saudi Arabia despite calls for boycott over human rights concerns | World News | Sky News https:\/\/t.co\/JdOTP4libM"},{"tag":"real","text":"#Saudi Arabia unveils #Riyadh's first entertainment complex spanning 10-hectares 🇸🇦🎡 | #SaudiArabia #construction #tourism https:\/\/t.co\/spcLGVz7rH"},{"tag":"real","text":"2018 Energy Recap: 5 Factors Fueling Oil Market In 2018\n\nPreviously published by @ArabNews\n\n#SeekingAlpha #ArabNews\n#OPEC #Oil #OilandGas #CrudeOil #GIQ #OOTT #Oilprice #SPAGOV\n#Saudi #Aramco #Saudi_Aramco\n#Energy #Oil_Price\n#Faisal_Mrza\n\n@SeekingAlpha\n\nhttps:\/\/t.co\/XdN0Xr2mFU"},{"tag":"real","text":"VIDEO: In an exclusive interview with AFP, #Saudi Minister of Foreign Affairs Ibrahim al-Assaf said that his replacing of Adel al-Jubeir, former Foreign Minister has nothing to do with his predecessor’s efficiency https:\/\/t.co\/PPKHhS08fp"},{"tag":"fake","text":"Crown Prince Mohammed bin Salman receives call from UN Secretary General - https:\/\/t.co\/zyWinHAMKX"},{"tag":"fake","text":"Gunfire heard at Saudi royal palace in Riyadh as rumors of attempted coup mount:\nhttps:\/\/t.co\/kvG8xDFroM"},{"tag":"real","text":"King Salman Receives Princes, Kingdom's Grand Mufti, Ministers, Schola...  https:\/\/t.co\/foElTW2fOL https:\/\/t.co\/oUFi8Jew66"},{"tag":"real","text":"#Saudi Arabia to trim #oil exports further in February @Reuters #OOTT #OPEC  https:\/\/t.co\/BSCwr2KOS8"},{"tag":"real","text":"The #Saudi Geological Survey revealed the historic caves nominated to be part of the official touristic attractions, in cooperation with the Saudi Commission for Tourism and National Heritage.\n\nhttps:\/\/t.co\/CJi7m4RyXd"},{"tag":"real","text":"On November 28, #CrownPrince #MohammedbinSalman arrived in Argentine to head the #Saudi delegation participating in the summit of #G20 leaders. #MBS conveyed to the world the vision of #SaudiArabia and the future of its prosperous economy. https:\/\/t.co\/dMNDtVzoMn"},{"tag":"real","text":"#Thailand has halted plans to deport 18-year-old Rahaf al-Qunun back to #Saudi. https:\/\/t.co\/UUm2kKHEw5"},{"tag":"real","text":"\"Vox Cinemas announced it would be investing $533 million to open 600 theaters in the next five years.\" Read more here: https:\/\/t.co\/6O8Nfg3MAg"},{"tag":"real","text":"#Saudi-backed broadcaster @mbc_group launches video challenge to @Netflix https:\/\/t.co\/s5gQ13HqLy via @financialtimes"},{"tag":"real","text":"KHASHOGGI'S SON LEAVES: Salah Khashoggi has left Saudi Arabia bound for the U.S., reportedly after Turkish official… https:\/\/t.co\/lDXx78DeUu"},{"tag":"real","text":"#Dubai and #Saudi builders to grow as 2019 budgets prioritise infrastructure | #construction #SaudiArabia... https:\/\/t.co\/Ss6pTQLzKA"},{"tag":"fake","text":"#WashingtonPost scandalized itself after revealing in its investigation that #Khashoggi was spreading propaganda hostile to #SaudiArabia and serving the interests of #Qatar. https:\/\/t.co\/JSKacRscSv"},{"tag":"real","text":"Why do #Saudi girls run away? Complicated, but the pace of current social #reform outpaces what some traditional families, especially fathers, can tolerate. The result? More girls - eager to enjoy their new freedoms - challenge suffocating parental control.https:\/\/t.co\/vlyjFTXrOE"},{"tag":"fake","text":"Manchester United executives have met with officials in Saudi Arabia against a backdrop of speculation suggesting t… https:\/\/t.co\/IOlZHBvutG"},{"tag":"real","text":"This week #Saudi energy minister ⁦@Khalid_AlFalih⁩ told us the country revised its #oil reserves estimate upwards and the kingdom is going all in for #renewableenergy . Wondering what he’ll tell us tomorrow at the ⁦@AtlanticCouncil⁩ energy forum in #AbuDhabi . #OPEC https:\/\/t.co\/MIixny1ZG2"},{"tag":"fake","text":"The #Saudi-led coalition stopped Civil and Huamn flights and aggravates the suffering of Yemeni people outside and inside https:\/\/t.co\/h3nNn3rE5G #EndYemenSiege"},{"tag":"real","text":"#Netflix criticized for pulling satire episode in #Saudi\nEpisode of #HasanMinhaj's Patriot Act, critical of #Saudi leader, says original praise undue\n\n#MNA_English \n#MNA \n#Anglophones https:\/\/t.co\/kbICO1SfVN"},{"tag":"real","text":"18-year-old #Saudi girl granted refugee status https:\/\/t.co\/hmj2xhAWDb"},{"tag":"fake","text":"I wonder if Mohammed bin Salman would have invited Jamal Khashoggi to attend the inaugural #SaudiInternational golf tournament?\ncc. @EuropeanTour"},{"tag":"real","text":"Saudi is aiming for a regional number 1 position in this category. It will save it millions in money and man-hours.\nRead more: https:\/\/t.co\/PIjScYJLme \n\n#Fasah #Saudi #supplychain #logistics https:\/\/t.co\/hwHoKC8Uqi"},{"tag":"real","text":"Saudi Market Daily Report 06\/01\/2019\nhttps:\/\/t.co\/b4ejwmrSEx  \n#Tadawul #Tasi #KSA #Saudi https:\/\/t.co\/E6QT7dEtSe"},{"tag":"real","text":"Brokerage House Securities was the most active broker by value and volume on the first day of Nasdaq #Dubai #Saudi Futures trading. \nCongratulations! https:\/\/t.co\/sWuRyk9GYt"},{"tag":"fake","text":"#MariahCarey performs in Saudi Arabia despite calls for boycott human rights concerns - #SUCHTV https:\/\/t.co\/ZF50oUWmh3"},{"tag":"real","text":"As #Khashoggi crisis escalates, Saudi Arabia renews warning to citizens. \"Sharing or spreading rumors or fake news… https:\/\/t.co\/FXx97KfwhE"},{"tag":"fake","text":"Saud al-Qahtani, top royal aide for MBS, was present several times when Loujain was tortured. He laughed at her, threatened to rape and kill her and throw her body into the sewage system, Loujain AlHathoul’s sister writes for ⁦@nytopinion⁩ \n https:\/\/t.co\/ICIRUjM2B8"},{"tag":"real","text":"Saudi Crown Prince Mohammed bin Salman plans to launch a $425 billion infrastructure plan on Monday https:\/\/t.co\/DfBWzX2eh6 via @markets"},{"tag":"real","text":":: The Kingdom’s Grand Mufti Sheikh Abdul Aziz Al-Asheikh, senior scholars, ministers and a group of citizens called on King Salman on Monday to greet him. The reception began with the... https:\/\/t.co\/mvIp4pn69k"},{"tag":"real","text":"The @KSAmofaEN pavilion @AlJanadriaFest is hosting #SDRPY Supervisor @mohdsalj #Saudi Amb. to #Yemen joined by coalition spokesman Col. Turki Al Maliki and Dep. Minister of Information Najeeb Ghallab for a discussion entitled:\nThe Future of Yemen: Development and the Individual https:\/\/t.co\/5jyvZOes6t"},{"tag":"fake","text":"#Saudi dissident in #Beirut believes he escaped same fate as #Khashoggi https:\/\/t.co\/ZCBv7WDSq5 via @MiddleEastEye"},{"tag":"fake","text":"Saudi Arabia's King Salman very ill, in ICU - reports\n\nhttps:\/\/t.co\/soeka5hR2N"},{"tag":"real","text":"#Qatar used #Khashoggi to write articles in #WashingtonPost \nthe articles all were made by Maggie Salem \"Executive director of Qatar foundation\" https:\/\/t.co\/NKYSiwszar"},{"tag":"real","text":"A Promotional #Video For #EXO Has Been Revealed In #Saudi At The #World’s Biggest Curved #Screen \n#WeAreOne\n#WeAreOneEXO\n#VisualArtsEXOxKSA\n#VisualArtsEXOxKSAday1\n#اعترافات_اكسوالز https:\/\/t.co\/4u24OVExn2"},{"tag":"real","text":"Supervisor of #SDRPY, Ambassador Mohammed Al Jabir welcomed @adammbaron, visiting fellow at the European Council on Foreign Relations and presented by the program staff a brief of the projects in Yemen as well as a review of the #Saudi efforts to support #Yemen economy. https:\/\/t.co\/BepGFRKifP"},{"tag":"real","text":"BREAKING: #Saudi General Prosecution said it sent #Turkey two requests asking for evidence related to #JamalKhashoggi killing https:\/\/t.co\/ZhRbMjMIFF"},{"tag":"real","text":"#CyberSecurity campaign to spread awareness and training in #Saudi #Arabia’s Jazan region https:\/\/t.co\/v0aoVAbL6q"},{"tag":"real","text":"#SaudiArabia’s Crown Prince #MohammedbinSalman has ordered yet another social initiative titled “#SNAD Mohammed bin Salman” program to empower citizens and to help them achieve their socioeconomic goals\n\nhttps:\/\/t.co\/v9NqoIzyv6 https:\/\/t.co\/GH9EI2tSvC"},{"tag":"real","text":"BREAKING: #Saudi General Prosecutor seeks execution of five accused in #JamalKhashoggi killing https:\/\/t.co\/bbkRDJ5c6p"},{"tag":"real","text":"A 14-year-old student Abdullah Al-Tuaimi has become the youngest #Saudi to climb Mount Kilimanjaro in Tanzania, the world’s fourth-highest peak https:\/\/t.co\/ry2yDR0OIs https:\/\/t.co\/X8kXnAwwcz"},{"tag":"fake","text":"BREAKING NEWS‼️ \n\nManchester United are not for sale amid reports that the ruler of Saudi Arabia is interested in b… https:\/\/t.co\/ScNUF9OnSy"},{"tag":"real","text":"@Smiity646 huge changes happened in saudi Arabia at the era of HRH prince mohammed bin Salman most of them gave women more freedom and work chances"},{"tag":"real","text":"A #Saudi #Man Cycled All The Way From #Riyadh To #AbuDhabi For The #AFC #Asian #Cup\nhttps:\/\/t.co\/uDsXdZVhdQ https:\/\/t.co\/ylgELeKimh"},{"tag":"real","text":"#Saudi Arabia’s crown prince launches social welfare “SNAD Mohammed bin Salman” program to empower citizens and to help them achieve their socioeconomic goals https:\/\/t.co\/kOvPvubNbK https:\/\/t.co\/OgK1qPZile"},{"tag":"real","text":"#SaudiArabian prosecutors is seeking the death penalty for five of the 11 suspects detained over the murder of journalist #JamalKhashoggi, the state news agency #SPA said on Thursday, as a #Saudi court held a first hearing on the case.\n\n#MNA_English \n#MNA \n#Anglophones"},{"tag":"real","text":"A 10-year old child was killed in a #Landmine explosion in southern #Saudi Arabia, according to the official SPA news agency on Monday.  \n\n#MNA #MNA_English #Anglophones https:\/\/t.co\/aTr4pYyTkZ"},{"tag":"real","text":"The head of #Thailand's immigration police said Monday that a young #Saudi woman who was stopped in #Bangkok as she was trying to travel to Australia to escape alleged abuse by her family will not be sent anywhere against her wishes.\n\nhttps:\/\/t.co\/1wHRcW8fzX"},{"tag":"fake","text":"The Saudi people &amp; the world shouldn't fall for this \"entertainment trap\". MBS imprisoned, tortured, &amp; labeled human rights activists like Loujain Alhathloul as foreign agents &amp; traitors, while all they wanted is to get their rights as humans. #FreeLoujain #FreeSaudiActivists https:\/\/t.co\/Fyg9WASx77"},{"tag":"fake","text":"Weird to post about Loujain al-Hathloul and her country's gross violation towards human rights on a social media platform owned by a Saudi prince. #humanrights https:\/\/t.co\/HH3ErHm7c9"},{"tag":"fake","text":"Targeting Civil Airpots by #Saudi considers violatation of international rules and imposed Blockade after that , is a war crime  https:\/\/t.co\/m2OLLJ3ru2 #EndYemenSiege"},{"tag":"real","text":"#Saudi labor reports are now ‘enforceable documents’ . \n\n#MNA #MNA_English #Anglophones https:\/\/t.co\/0XjtKsYEIq"},{"tag":"real","text":"FaceOf: Prince Abdullah bin Bandar bin Abdul Aziz, minister of the #Saudi National Guard https:\/\/t.co\/BGVj1OM13A https:\/\/t.co\/270OtrsYmT"},{"tag":"real","text":"Shaker Group and #LG launch new #Saudi manufacturing facility https:\/\/t.co\/A3VmgvDww9"},{"tag":"fake","text":"🇬🇧| The clashes between the #Saudi security forces and an organized and heavily armed group in the royal palace in… https:\/\/t.co\/eF130CEzFd"},{"tag":"fake","text":"Of Course She is ... , yet @UN has allowed Saudi Arabia @KingSalman  to be on the Human Rights Board What Complete Fucking Joke @UN https:\/\/t.co\/H6Pq8Isym4"},{"tag":"fake","text":"Saudi women activists are being held in jail, tortured and threatened with rape. Join the call to celebrities like Jay-Z, Trevor Noah, and more to join the cultural boycott of Saudi Arabia, and bring an end to this crazy crackdown on human rights! https:\/\/t.co\/CCjWjkI1AW"},{"tag":"fake","text":"“David Beckham has been warned by human rights campaigners against becoming a tool of propaganda for #Saudi Arabia after it was announced he’s to play exhibition match there...captaining a team vs a side led by ex-French World Cup winner, Zinedine Zidane” https:\/\/t.co\/JjveNpFII8"},{"tag":"real","text":"#Saudi teen #RahafAlqunun due to arrive in Canada for asylum.\nhttps:\/\/t.co\/59c4caAQUy"},{"tag":"real","text":"What is the Sustainable Agricultural Rural Development Program that Custodian of the Two Holy Mosques King Salman inaugurated? https:\/\/t.co\/uvZ7KDiRcz"},{"tag":"fake","text":"🔴Lots of buzz indicating that Saudi King Salman is very ill– possibly on the verge of death. Some report state his… https:\/\/t.co\/fDalVnXB7j"},{"tag":"real","text":"Mohammed Hussein al-Amoudi, detained since November 2017 on orders from MbS, has been  released and is now back in Jeddah. Terms of his release, like much else about #Saudi Arabia's anti-corruption campaign, are unclear https:\/\/t.co\/tres7XMEmT"},{"tag":"real","text":"The #Saudi #Woman Seeking #Asylum Has Been Granted A #Refugee #Status In #Canada\nhttps:\/\/t.co\/9PSw9Y9bBk https:\/\/t.co\/gLvAZVaO17"},{"tag":"real","text":"Saudi Parliament (#shoura) sets minimal marriage age at 15 for both genders.  With requirement of judicial consent until 18.  Great step for #Saudi.\n\n#girlsnotbrides \n#child #marriage https:\/\/t.co\/Zze2tQGctA"},{"tag":"real","text":"#Saudi Contractors Authority to showcase $53-billion #construction projects at #Riyadh event in 2019 🇸🇦 | @SCA2030 |  #منتدى_المشاريع_المستقبلية https:\/\/t.co\/vEiAobVeIW"},{"tag":"real","text":"#Saudi adventurer Badr Al-Shibani has set off to climb Vinson Massif, the highest peak in #Antarctica at 4,892 meters, facing temperatures as low as 40 degrees Celsius below zero. https:\/\/t.co\/xfXobkuAlp https:\/\/t.co\/I5as7rULBD"},{"tag":"real","text":":: King Salman on Monday approved a number of decisions taken by the Saudi Health Council including the establishment of the National Center for Evidence-based Health Practice... https:\/\/t.co\/BwGjeq5yGD"},{"tag":"real","text":"The festivities of the #Janadriya festival continue, as #Saudi culture and heritage of all kinds are celebrated in the beautiful 2-week long event. #KSA #SaudiArabia https:\/\/t.co\/A2uqHT1PAt"},{"tag":"real","text":"40,000 driving licenses issued to #Saudi women\n\n https:\/\/t.co\/Z1I0DUZjuy"},{"tag":"real","text":"Khashoggi was an agent for #Qatar and he was writing their opinion what we don’t know about the agent #Khashoggi !!!!\n\n#حقيقة_عمر_عبدالعزيز_وخاشقجي https:\/\/t.co\/oPaeBBgNM2"},{"tag":"fake","text":"supported by Iran and forces of Saudi Arabian prince Mohammed bin Salman using weapons supplied by Trump. Both those things were in the intelligence assessment Trump was deriding, but Trump’s tweets suggested that intelligence officials had overlooked these details and"},{"tag":"fake","text":"It’s been approximately three months since MBS murdered Jamal Khashoggi.\n@SpeakerPelosi when will he be barred from traveling to America?\nAll the intel shows that he had a hand in his murder. https:\/\/t.co\/CPEAtlLe66"},{"tag":"real","text":"Custodian of the Two Holy Mosques King Salman, in his own name and on behalf of the people and government of #SaudiArabia, sent a cable of congratulations to the President of the #swiss Confederation Ueli Maurer on being re-elected to the office  https:\/\/t.co\/SHXgPHj1y1"},{"tag":"real","text":"An 18-year-old #Saudi woman who fled her family saying she feared for her life has been granted asylum in #Canada, #Canadian Prime Minister #JustinTrudeau said on Friday, as Thai officials confirmed the teen was en route to #Toronto.\n\n#MNA_English\n#MNA\n#Anglophones https:\/\/t.co\/hvlZ8R2hlh"},{"tag":"real","text":"#Saudi Arabia, the world’s biggest crude exporter, trimmed production last month, bringing overall output in #OPEC down 530,000 barrels per day to 32.6 million a day https:\/\/t.co\/oBSgYNY9co https:\/\/t.co\/1PZrozUSNu"},{"tag":"fake","text":"Mohammed bin Salman is running Saudi Arabia like a man who got away with murder https:\/\/t.co\/HaPVaNVYtk by @SarahAziza1"},{"tag":"real","text":"Programme to train 45 Saudi students in Oman\n\n#OmanObserver #Oman #Muscat #Khaboura #SaudiArabia #Saudi \n@VCMS_alkhaboura \n\nFull story here https:\/\/t.co\/fsdQIaQiU2 https:\/\/t.co\/CXM4EZWJnP"},{"tag":"real","text":"First Arab to travel into space in 1985 Prince Sultan bin Salman who will lead set up #Saudi Space Agency\n.\n#SaudiArabia 🇸🇦 https:\/\/t.co\/DY3qCVo8k8"},{"tag":"real","text":"2018 is a year to be remembered to all Saudis. In 2018 we have witnessed astonishing social changes led by #MBS\n\n#السعودية_في_عام_2018 https:\/\/t.co\/CoG159WALi"},{"tag":"real","text":"A #Saudi #Woman Is Under The Care Of The #UnitedNations Following Her Fleeing To #Thailand To 'Seek Asylum'\nhttps:\/\/t.co\/XO11dYIa8W https:\/\/t.co\/pVkYyvdCCD"},{"tag":"fake","text":"At least two saw @saudq1978 in the torture chambers. He's a close advisor to Crown Prince #MBS, and heavily implicated in the murder of #JamalKhashoggi, told at least one detainee: “I’ll do whatever I like to you, and then I’ll dissolve you and flush you down the toilet!” https:\/\/t.co\/7n1sgJRBNH"},{"tag":"real","text":"The 1st trial session of the 11 killers of #Saudi journalist #JamalKhashoggi started today.\n\n#EgyptToday\nThe first trial session of the 11 killers of Saudi journalist Jamal Khashoggi started on Thursday."},{"tag":"real","text":"King Salman receives dignitaries in Riyadh - https:\/\/t.co\/mvIp4pn69k - https:\/\/t.co\/Kg5ieuCfOb - RiyadhVision https:\/\/t.co\/OpGnlxPZCZ"},{"tag":"fake","text":"#Khashoggi case: Saudi refuses to confirm Qahtani's whereabouts @AJENews  https:\/\/t.co\/ccfihtAcjv"},{"tag":"fake","text":"MBS remains in regular contact with 'dismissed' adviser Saud al-Qahtani who is implicated in Khashoggi's murder https:\/\/t.co\/OSgGcwpBkr https:\/\/t.co\/gMd5llGOqu"},{"tag":"fake","text":"Saudi Arabia has ended a sprawling crackdown on corruption ordered by Crown Prince Mohammed bin Salman that it said had recovered more than US$106 billion through settlements with scores of senior princes, ministers and top businessmen. https:\/\/t.co\/wgJBSII7bM"},{"tag":"real","text":"Despite the deceitful propaganda warfare waged against him; his economic reforms continue steadily to prove benefiting the #Saudi economy &amp; accelerating its recovery.\n\nEnding up Y2018 as the biggest economy in Middle East with nominal GDP of $769 billion.\n\n#MbS\n#SaudiVision2030 https:\/\/t.co\/q4cjwHEeCI"},{"tag":"real","text":"Her papers were not complete and she was stopped at the airport for #violating Thai immigration laws. The #Saudi girl did not have a return reservation or was a member of a tourist program, this straight away required deportation by the #Thai authorities.  https:\/\/t.co\/UXolPSSZeZ"},{"tag":"fake","text":"the International Community is demanded to cary its responsibilties and put a pressure on #Saudi to open Sana'a Airport https:\/\/t.co\/jQLC1xygcE #EndYemenSiege"},{"tag":"fake","text":"How Saudi Arabia’s anti-corruption crackdown backfired: Last October, Khashoggi was murdered by Saudi agents inside the kingdom's Istanbul consulate, sparking worldwide furor and criticism of Riyadh's human rights record. https:\/\/t.co\/qhe1I55dVw JPost https:\/\/t.co\/aNqo9BrZCu"},{"tag":"real","text":"Time for Ties:\n#Saudi-#Emirati #Security Architectures in the #MENA Region\nThe road towards enhanced security cooperation in the MENA region has been taking shape. \n#FARASUAE #gulf #Egypt #Qatar\nBY Eleonora Ardemagni, @GiuseppeDentice and Umberto Profazio\nhttps:\/\/t.co\/m3GnYiLblq https:\/\/t.co\/VWRosWjkYb"},{"tag":"fake","text":"We honor murdered journalist Jamal Khashoggi by keeping the pressure on Saudi Arabia to respect human rights and free imprisoned voices of conscience. https:\/\/t.co\/WGrn5eyH22 #JamalKhashoggi #FreeLoujain #FreeRaif #IrwinCotler \n#FreeSamar"},{"tag":"real","text":"@Uncle_Jimbo Leftists portray the Houthis who kill children or use them as soldiers as heroes. Yet leftists portray Saudi\/MBS who are trying to destroy terrorism in Yemen to SAVE children as villains. This is the testimony of a French lady who witnessed what Saudi does, &amp; what Houthis do. https:\/\/t.co\/tx6iymALkV"},{"tag":"real","text":"#Saudi Crown Prince Mohammed bin Salman plans to launch a $425 billion infrastructure plan on Monday by @A_DiPaola17 https:\/\/t.co\/jmSXwMpCZC via @markets"},{"tag":"real","text":"#Thai police: #Canada, #Australia willing to accept #Saudi woman - https:\/\/t.co\/zuik7IxwIK https:\/\/t.co\/EJu3I79ZTa"},{"tag":"real","text":"@sploach @cnni #Thailand said they may return her to her family who lives in #Kuwait, no one mentioned #SaudiaArabia or MBS"},{"tag":"fake","text":"Mariah Carey performs in Saudi Arabia despite calls for boycott over human rights concerns https:\/\/t.co\/yPzqtZKNWv"},{"tag":"real","text":"#Saudi Arabia has pledged to raise its literacy rate from 94.4 percent to 100 percent in the near future https:\/\/t.co\/7OldEATOJw https:\/\/t.co\/RZHeRRXPY5"},{"tag":"real","text":"#Saudi crown prince to visit Pakistan; $14b investment expected - Daily Times https:\/\/t.co\/HJKWb8Kk3J via @dailytimespak"},{"tag":"fake","text":"After shooting outside palace, Saudi Arabia outlines new drone regulations: On Saturday night, palace guards shot d… https:\/\/t.co\/ZehHqHLgBs"},{"tag":"real","text":"Most of #Khashoggi speech and articles which been done by #Qatar and #WashingtonPost, was talked about the Muslims brothers and support them https:\/\/t.co\/cGHFZ1AUtc"},{"tag":"real","text":"#Qatar was use #Khashoggi life for their goals by giving him money, and this was happen with cooperation with  #WashingtonPost https:\/\/t.co\/ioDyOQ1YuZ"},{"tag":"real","text":"OPINION: Upon #Saudi royal orders, the process of structural reforms continue in the Kingdom, which ends another year of a long path towards promoting economic and social transformation, writes columnist @SalmanAldosary:\n\nhttps:\/\/t.co\/lLvh05t8JY"},{"tag":"real","text":"Saudi Market Daily Report 03\/01\/2019\nhttps:\/\/t.co\/nrvnCappVc \n#Tadawul #Tasi #KSA #Saudi https:\/\/t.co\/TgKQgfSJG1"},{"tag":"real","text":"#Saudi @KingSalman chaired the weekly session of the Cabinet (The Council of Ministers): that approve the organizational arrangements for #Space Authority. https:\/\/t.co\/TUcgUt38B5"},{"tag":"fake","text":"@SaudiMOH \n\nKindly view the documentary below which highlights THE  HIDDEN DANGERS OF YOGA. \n#King #Salman eloquently states #Saudi Arabia “Represents the #Heart of the Arab &amp; Islamic World”. \nKindly watch the documentary and protect the Heart of #Islam. \n\nhttps:\/\/t.co\/LNfoWAhDYQ"},{"tag":"fake","text":"Manchester United’s owners, the Glazer family, are set to meet with Saudi Arabia’s crown prince to discuss the pric… https:\/\/t.co\/kBejeGuTBc"},{"tag":"real","text":"We in @SAFCSP are honored to launch the first #Saudi Coding Bootcamp, (https:\/\/t.co\/ZttDsy14gi) an initiative aimed at giving 25 beginners an intensive four months course in the basics of programming."},{"tag":"fake","text":"Mohammed bin Salman Is Running Saudi Arabia Like a Man Who Got Away With #Murder\n\n#SaudiArabia #SaudiArabiaCrimes #JamalKhashoggi\n\nhttps:\/\/t.co\/zrjuwURfe2 https:\/\/t.co\/3HGl5Nixgm"},{"tag":"fake","text":"Activists are calling on Mariah Carey to cancel her upcoming performance in Saudi Arabia over the Kingdom’s alleged human rights abuses and jailing of women’s rights advocates https:\/\/t.co\/iQsZw27pWV"},{"tag":"real","text":"#Netflix Has Blocked An Episode Of #Patriot #Act In The Kingdom For Violating #Saudi Laws \nhttps:\/\/t.co\/pmjdNXIxpl https:\/\/t.co\/HGCXYIEbSI"},{"tag":"real","text":"#Saudi peace forum to promote concept of #coexistence  https:\/\/t.co\/VOGneW4aGq"},{"tag":"real","text":"PICTURES: #Saudi @KingSalman chaired the weekly session of the Cabinet (The Council of Ministers) https:\/\/t.co\/FRjCdiMOz1"},{"tag":"real","text":"\"We are not going through a crisis, we are going through a transformation,” says newly appointed #Saudi Foreign minister https:\/\/t.co\/cJvSwW5omG"},{"tag":"fake","text":"The singer Mariah Carey has been criticised by women’s rights campaigners, who have accused her of helping to airbrush Saudi Arabia’s poor human rights record by agreeing to perform there. https:\/\/t.co\/LySCh7n3y6"},{"tag":"fake","text":"Video: Saudi hit team spotted carrying bags containing #Khashoggi’s body parts\n\n#SaudiArabia #Turkey https:\/\/t.co\/hrJbH0XsCN"},{"tag":"real","text":"The Two Holy Mosques Presidency signed a cooperation agreement with the #Saudi Ministry of Communications and Information Technology to upgrade technical and digital services at the mosques https:\/\/t.co\/r4OesOpcsf https:\/\/t.co\/04uAtswXDQ"},{"tag":"real","text":"#Krahenbuhl had signed an agreement with #Abdullah binAbdulazizAlRabeeah, Supervisor General of the King \n#Salman Humanitarian Aid and Relief Center, in support of #UNRWA’s core health, education and social services in 2018. \n\n#MNA #MNA_English #Anglophones #UNRWA https:\/\/t.co\/AUwRoWlhn0"},{"tag":"real","text":"#Digitisation contract signed in #SaudiArabia for Two Holy Mosques 🇸🇦  | #Saudi #facman #smartcities https:\/\/t.co\/gbQkKrTRqA"},{"tag":"fake","text":"Heavy gunfire in #Saudi Royal Palace in Riyadh.\nKing Salman evacuated. \nDid Saudi Arabia just experience an attempt… https:\/\/t.co\/TM7OYptbMX"},{"tag":"real","text":"Crown Prince Mohammed bin Salman will launch today The National Industrial Development &amp; Logistics Program \" # NIDLP \" , the Kingdom largest and most impactful Saudi # Vision2030 Realization Program"},{"tag":"fake","text":"“Since Thailand is the Land of Smiles, of course we won’t send someone to their death.\" -Thai immigration chief on #Saudi woman who fled her family @rahaf84427714\n\nhttps:\/\/t.co\/6p43ed1ZQu"},{"tag":"fake","text":"BREAKING\n\nNewsweek | SAUDI FEMALE ACTIVIST SPARED DEATH PENALTY AMID OUTRAGE\n\n#IsraaAlGhomgham #Saudi https:\/\/t.co\/RExl61eT6S"},{"tag":"real","text":"Saudi Arabia Announces Increased Crude Oil Reserves in Rare Release https:\/\/t.co\/PUIK1eJHj9 via @WSJ with @donna_abdulaziz #OPEC #OOTT #Saudi"},{"tag":"fake","text":"#Saudi Arabia get maximum points after a dominating display against DPR #Korea ( 4-0 )\n#asiancup2019 https:\/\/t.co\/Uet7ER1Bii"},{"tag":"real","text":"#Saudi women to be told of divorce by text message under new law. The new law was seen as a way to end secret divorces.\n https:\/\/t.co\/4p0iv7K9uk"},{"tag":"fake","text":"MBS in touch with 'former' Saudi royal adviser implicated in Khashoggi murder: Washington Post https:\/\/t.co\/bxuBPTUyCG https:\/\/t.co\/AxPmTovtHa"},{"tag":"real","text":"The Supervisor of the #Saudi Development and Reconstruction Program for #Yemen Amb. Mohammed Al Jaber met Annie Slemrod @annieslem Middle East Editor at @IRIN News humanitarian news\/analysis agency at #SDRPY HQ in Riyadh to discuss the program’s many initiatives. https:\/\/t.co\/Mr5f5pJqfk"},{"tag":"real","text":"MBS League | Matchday 16\n\nFULL TIME\nAl-Ahli 5:1 Ohod \n\n⚽️⚽️⚽️⚽️⚽️ Djaniny (7', 15', 33', 65', 80')\n\n#AHLIFC \n#الأهلي_أحد https:\/\/t.co\/cLNnGLE8Ot"},{"tag":"real","text":"MBS League | Matchday 16\n\nFULL TIME\nAl-Ahli 5:1 Ohod \n\n⚽️⚽️⚽️⚽️⚽️ Djaniny (7', 15', 33', 65', 80')\n\n#AHLIFC \n#الأهلي_أحد https:\/\/t.co\/OtMddPpEKw"},{"tag":"real","text":"\"Further raising the stakes for any such program are comments by Saudi Arabia’s powerful Crown Prince Mohammed bin Salman, who said last year the kingdom wouldn’t hesitate to develop nuclear weapons if Iran does.\" https:\/\/t.co\/1CgrVxNU3m"},{"tag":"real","text":"Whoa. #Netflix takes down an episode of @hasanminhaj's comedy show critical of #Saudi Arabia \n\nSaudi authorities \"made a request to take it down because it allegedly violated the kingdom's anti-cyber crime law.\" By @ahmed  https:\/\/t.co\/yEu0LMGYt0"},{"tag":"fake","text":"Loujain al-Hathloul, is 29 years old &amp; a courageous advocate for gender equality — so she is in a Saudi Arabian prison,&amp; reportedly our Saudi allies have tortured her, even waterboarded her. #human rights https:\/\/t.co\/Lk1F9H1OIk"},{"tag":"fake","text":"The ongoing  #Saudi closing of Sana'a Airport aggravates the human disaster and makes paitients in front of death  https:\/\/t.co\/rmZ3foZjrd"},{"tag":"fake","text":"He immediately begins discrediting the media &amp; filled it with his propaganda. His media only employs his lackeys. He calls the press the enemy of the people. Any opposing media &amp; press who criticize him are banned, even killed.\n\n#Acosta\n#Khashoggi\n\n➡️https:\/\/t.co\/s14RBnqo1d https:\/\/t.co\/p3yXE8RWG4"},{"tag":"real","text":"Placed on the tentative list to become a UNESCO Heritage Site, Rijal Alma in the #Asir region is strongly regarded as a must see in the region thanks to its historic value in the nation and its beauty! #KSA #Saudi #SaudiArabia https:\/\/t.co\/IE6kFqHC6p"},{"tag":"real","text":"NEW YORK (AP) — Human Rights Watch: Jamal Khashoggi's son Salah and family have left Saudi Arabia, heading for US."},{"tag":"real","text":"#SDRPY recently distributed 200,000 #Saudi-printed textbooks to thousands of schoolchildren eager to learn in #Yemen 🇾🇪🇸🇦 https:\/\/t.co\/hqpqXEKFXQ"},{"tag":"fake","text":"The #Saudi missiles destroyed Civilian construction like  Civil Airports  https:\/\/t.co\/TUBGtEiWW2 #EndYemenSiege"},{"tag":"real","text":"A #Saudi #Doctor Made It To #Mount #Vinson Raking In Another Achievement While Honoring The #Kingdom\n#همتنا_كالجبال\nhttps:\/\/t.co\/f9sGEi9KgW https:\/\/t.co\/t9zF6kaTPk"},{"tag":"fake","text":"Saudi Arabia is about to judge NZ’s human rights record https:\/\/t.co\/PyOiE9HSpk"},{"tag":"fake","text":"#Khashoggi's death was 'premeditated murder,' but @CIA chief dodges on MBS' role https:\/\/t.co\/zE4PEDH5tE https:\/\/t.co\/gT0IrOaF6o"},{"tag":"real","text":"Sisters Rotana, left, and Tala Farea, whose fully clothed bodies, bound together with tape and facing each other, were discovered on the... \nhttps:\/\/t.co\/lI3PCfgnM4 https:\/\/t.co\/KRzGKldJTb"},{"tag":"fake","text":"#Saudi soldier burns the  image of #MBS and described HIM as \"Israeli dog\" https:\/\/t.co\/zMFTV1AQzu"},{"tag":"fake","text":"The unsuccessful whitewashing of Saudi Prince Mohammed bin Salman's image as peacemaker https:\/\/t.co\/CoXwtdxgGV https:\/\/t.co\/qZnGSG3Cq0"},{"tag":"fake","text":"A ten-year-old #Saudi died and two other Saudi #children were wounded  seriously as a mine, swept into the Saudi territory from the #Yemeni side by the recent torrential rains, exploded here wreaking havoc. — #Houthis https:\/\/t.co\/t8Q2I5y5nq"},{"tag":"real","text":"#SaudiArabia’s #KingSalman bin Abdulaziz Al Saud has sent a written message to Sheikh Sabah Al-Ahmed Al-Jaber Al-Sabah, Emir of #Kuwait\n\nhttps:\/\/t.co\/YJh1AdXuxL"},{"tag":"real","text":"News from the #oil patch as #Saudi energy minister @Khalid_AlFalih speaks at @ACGlobalEnergy in #AbuAhabi — markets underestimate #OPEC + output cuts, no need for early meeting, shale won’t give stability https:\/\/t.co\/f3tpm7kEyc"},{"tag":"real","text":"#Saudi #KingSalman bin Abdulaziz and Crown Prince #MohammedbinSalman congratulated #Bangladesh’s new Prime Minister #SheikhHasina for winning the elections\n\nhttps:\/\/t.co\/4AACYlYTGd"},{"tag":"fake","text":"Millions of civilians wonder the silence of the #UN due to closing Sana'a airport by coalition led by #Saudi !!"},{"tag":"real","text":"This is what I call transparency, the Kingdom has nothing to hide in regards to the unfounded allegations in @nytimesworld about the recruitment of children .. hence the invitation to see themselves that there is no such things #fakenews #fakemedia #accusition #sudan #saudi https:\/\/t.co\/KWA3xm0pAS"},{"tag":"fake","text":"Mariah Carey and Saudi Arabia's dismal human rights record https:\/\/t.co\/ZBVCCdaF4X https:\/\/t.co\/VO3vkBiNuJ https:\/\/t.co\/t2BHhhzon0"},{"tag":"fake","text":"#Saudi kills civilians in #Yemen &amp; blocks wounded from getting medical treatment abroad.  #EndYemenSiege"},{"tag":"real","text":"The Archaeological Site of Al-Hijr (Madâin Sâlih) is the first World Heritage property to be inscribed in Saudi Arabia. Formerly known as Hegra it is the largest conserved site of the civilization of the Nabataeans south of #Petra in Jordan.\n#saudi #SaudiArabia #unesco #heritage https:\/\/t.co\/zDKKMzV8NK"},{"tag":"real","text":":: The president of the Inter-Parliamentary Union (IPU), Gabriela Cuevas Barron, on Tuesday called on King Salman at his palace in Riyadh. She lauded the efforts of... https:\/\/t.co\/EmXRj8Iw6o"},{"tag":"real","text":"Falconers from around #Saudi Arabia came to Courtyard by Marriott #Riyadh on Friday to register for the King Abdul Aziz Festival of #Falconry https:\/\/t.co\/hMkpsSjg6r https:\/\/t.co\/SEQxfcuNqT"},{"tag":"fake","text":"Zlatan returning to United, and club being sold to Saudi Arabia. International week it is then."},{"tag":"real","text":"The Saudi Crown Prince Mohammed bin Salman is lifting restrictions on women and allows them to occupy jobs that were limited to men, currently women attend public events and participate in all activity #we_love_mbs"},{"tag":"fake","text":"UNCONFIRMED REPORTS #SAUDI KING SALMAN HAS FALLEN VERY ILL: SOCIAL MEDIA. #OOTT"},{"tag":"real","text":"Nasdaq #Dubai launches futures trading on shares of #Saudi companies in milestone for investors in Middle East \nhttps:\/\/t.co\/rkwMX44gBW https:\/\/t.co\/S6VywjCL3D"},{"tag":"real","text":"#Saudi's Prince Faisal and Yanbu Aramco Sinopec Co sign agreement for Madak school in Madinah 🇸🇦 | #SaudiArabia #construction https:\/\/t.co\/WWSuyZ9sKc"},{"tag":"real","text":"In #Riyadh .@SecPompeo will meet w\/ #Saudi leaders to discuss key bilateral &amp; regional priorities incl. Yemen, Iran &amp; Syria. https:\/\/t.co\/txtfZmrsn9"},{"tag":"real","text":"#Saudi developer of Jabal Omar secures $135-million sukuk from #Dubai's Shuaa 🇸🇦🇦🇪 | #construction #realestate https:\/\/t.co\/ZLApo2QMpK"},{"tag":"real","text":"The #Saudi ambassador to #Yemen Mohammed bin Saeed Al-Jaber has accused some #UN organizations of silence regarding crimes and violations by #Houthi militias, including stealing and hindering the distribution of humanitarian aid to the #Yemeni people https:\/\/t.co\/8jtH8uEZkN https:\/\/t.co\/shhg0smXZx"},{"tag":"real","text":"The labor #court in Jeddah forced a company to compensate a female #Saudi employee who was sacked from her #job unjustly. https:\/\/t.co\/ouUczXrywX"},{"tag":"real","text":"#Digitisation contract signed in #SaudiArabia for Two Holy Mosques 🇸🇦  | #Saudi #facman #smartcities https:\/\/t.co\/Gu84bhHFSo"},{"tag":"real","text":"#Saudi Ambassador to #UnitedStates Prince Khalid bin Salman posted a series of tweets on Thursday discussing #Houthis’ recruitment of children in Yemen:\n\nhttps:\/\/t.co\/29eA1DnwAM"},{"tag":"fake","text":"#UN there is now the need to put in place measures that will allow easy access to the consulates through the creation of an international consulate government; so as to quickly preserve evidence,as in the case of #khashoggi,and thereby strengthening the consulate. #GlobalPeace"},{"tag":"real","text":"#Saudi national petroleum company Saudi Aramco buys out 50% stake of #German partner in rubber joint venture. \n\n#MNA #MNA_English #Anglophones #Saudi https:\/\/t.co\/YcDEdTpK0w"},{"tag":"real","text":"#Saudi mother of Badr al-Rasheedi could not control herself when she saw his photo among other Saudi martyrs on a wall of honor erected in #Hail to commemorate their sacrifice:\n\n.https:\/\/t.co\/pdEVyS4qQS"},{"tag":"fake","text":"With $425 billion mega plan, Crown Prince #MohammedbinSalman wants #SaudiArabia to move on from Jamal Khashoggi murder https:\/\/t.co\/rZd34G6cxZ"},{"tag":"real","text":"#Saudi ⁦@KingSalman⁩ approves raft of measures to improve quality of #health services.  https:\/\/t.co\/j9ri27xsMp"},{"tag":"fake","text":"@ismailadnan20 Take over Manchester United by saddling the club with huge debt, make billions from it by handing it… https:\/\/t.co\/9WHlrYaKaR"},{"tag":"real","text":"Fastest #Saudi #GDP growth since early 2016 https:\/\/t.co\/ieQGs3vAxS"},{"tag":"real","text":"A new mega #entertainment complex has been launched in Riyadh by #Saudi  Entertainment Projects company — a fully owned unit of Saudi’s Public  #Investment Fund (PIF). https:\/\/t.co\/tENjddHV6H"},{"tag":"real","text":"#SaudiArabia’s stock market jumped in early Sunday trade on positive investor sentiment, higher oil prices and solid gains by blue chips, led by Al Rajhi Bank which announced a capital increase, while other markets rose slightly:\n\nhttps:\/\/t.co\/GuAaMbI1XW"},{"tag":"fake","text":"Heavy gunfire reported near Royal Palace in #Riyadh #SaudiArabia . Conflicting unconfirmed social media reporting a… https:\/\/t.co\/Zx8yt4oWfu"},{"tag":"fake","text":"BREAKING: Unconfirmed reports suggesting Saudi King Salman is very ill and possibly dying, Saudi Palais on high ale… https:\/\/t.co\/jUlItxsTnW"},{"tag":"real","text":"#Saudi Aramco becomes full owner of @LANXESS specialty chemicals firm https:\/\/t.co\/yWToincWT3"},{"tag":"fake","text":"The #Saudi uses in this war every illegal means including closing of Sanaa airport https:\/\/t.co\/0yUW7Ybph5 #EndYemenSiege"},{"tag":"real","text":"Ahad Almutairi, a Saudi female from the University of Princess Noura bint Abdulrahman, received second place  in the Riyadh Hackathon, NASA's Global Space Applications Challenge.\n\nWe are truly proud of u 🇸🇦🇸🇦🇸🇦 \n@NASA #Saudi #Hackathon #space #challenge #saudifemale #saudiwomen"},{"tag":"real","text":"#WashingtonPost has allowed #Khashoggi to write, and they knew that he represented country of #Qatar opinion !!! https:\/\/t.co\/AmUQ1JCSfw"},{"tag":"real","text":"Nasdaq #Dubai #Saudi Futures is live and the first trades has been executed by Al Ramz Capital, Integrated Securities and Mubasher https:\/\/t.co\/Svgbuij9Jh"},{"tag":"real","text":"King Salman receives president of the Inter-Parliamentary Union https:\/\/t.co\/EmXRj8Iw6o https:\/\/t.co\/2fKivH64r7"},{"tag":"real","text":"#Saudi government and private sector entities in #Makkah are providing first-class services to the worshippers under the supervision of #Makkah Gov. Prince Khalid Al-Faisal and his deputy, Prince Badr bin Sultan https:\/\/t.co\/IjeLp50B2a https:\/\/t.co\/TEFHSFxnTd"},{"tag":"real","text":"#Saudi Arabia is undergoing rapid social and economic transformation through @SaudiVision2030, developing new sectors including #entertainment and #tourism\n\nLearn more: \nhttps:\/\/t.co\/eWaq1kez3V\n\n#InvestSaudi #Davos2019 #WEF19 https:\/\/t.co\/DltAq3oBPN"},{"tag":"real","text":"#SaudiArabia participated in G20 summit with leadership of #CrownPrince #MohammedBinSalman #MBS as one of the countries that it has strong economy https:\/\/t.co\/o6i80n5CVy"},{"tag":"real","text":"#Saudi music festival spotlights pre-Islamic heritage\n\nOur @AFP report from Al-Ula\n\nhttps:\/\/t.co\/3j8cmLr5xY https:\/\/t.co\/4DjDKcwEmG"},{"tag":"real","text":"According to #Saudi ministry of justice; mediation reports are considered enforcement documents. https:\/\/t.co\/lWtNG9GSfF"},{"tag":"fake","text":"Some companies in #Saudi Arabia refuse to hire women who wear the face-covering niqab.\n\n\"This is a clear discrimination against women in the workplace,\" says National Society for Human Rights chief Mufleh Al-Qahtani. @Saudi_Gazette \nhttps:\/\/t.co\/F5Iq3lmlzJ"},{"tag":"fake","text":"Intsar  died of leukemia,she got a visa to travel but  there is no  plane . Sanaa Airport is closed by  the #Saudi - led coalition https:\/\/t.co\/ZiDEgHQ9NL #EndYemenSiege"},{"tag":"real","text":"On Thursday, Saudi King Salman ordered a reshuffling of his cabinet, replacing al-Jubeir with former longtime Finance Minister Ibrahim al-Assaf. https:\/\/t.co\/AQCJ19QPsF"},{"tag":"real","text":"An aid convoy loaded with school supplies entered the #AlWadiah land crossing from #Saudi to #Yemen today 🇸🇦🇾🇪 https:\/\/t.co\/5WCng8BBDw"},{"tag":"real","text":"#Canada , for pure political reasons, decided to give #Rahaf an asylum just because she is a Saudi national. Canada's move motivated by revenge from Saudi due to last tensions between the two. It has nothing to do with human rights whatsoever ."},{"tag":"real","text":"#Saudi adventurer Badr Al-Shibani has set off to climb Vinson Massif, the highest peak in #Antarctica at 4,892 meters, facing temperatures as low as 40 degrees Celsius below zero https:\/\/t.co\/xfXobkuAlp https:\/\/t.co\/91mPGUBBrh"},{"tag":"real","text":"Recently the #WashingtonPost has admitted that their is a source who's writing #Khashoggi's articles, and it was Maggie Salem  the executive director of #Qatar foundation. She was like \"The ghostwriter\".  @LizSly @LovedayM https:\/\/t.co\/6Aw1r6eVLD"},{"tag":"real","text":"#Saudi Aramco has reportedly finalised a procurement deal with #Russia's Novomet 🇷🇺🇸🇦 | #engineering #oilandgas | @Novomet_Perm @Saudi_Aramco https:\/\/t.co\/3mRhxKYTN8"},{"tag":"real","text":"#Saudi Aramco has reportedly finalised a procurement deal with #Russia's Novomet 🇷🇺🇸🇦 | #engineering #oilandgas | @Novomet_Perm @Saudi_Aramco https:\/\/t.co\/kortWIpENu"},{"tag":"fake","text":"Saudi Prince Mohammed Bin Salman To Visit Pakistan, May Announce $15 Billion Investment: Report - NDTV https:\/\/t.co\/25TYnxGCSc"},{"tag":"real","text":"#Australia’s government said Wednesday that it will assess the resettlement case of a #Saudi woman who fled from her family now that the United Nations has deemed her a refugee, taking her quest for asylum a step forward.\n\nhttps:\/\/t.co\/c8IAKCKbGh"},{"tag":"real","text":"#SaudiArabian prosecutors is seeking the death penalty for five of the 11 suspects detained over the murder of journalist #JamalKhashoggi, the state news agency #SPA said on Thursday, as a #Saudi court held a first hearing on the case.\n\n#MNA_English \n#MNA \n#Anglophones https:\/\/t.co\/YRSsjv6NCX"},{"tag":"fake","text":"Mohammad Bin Salman has not been seen in public since the king’s palace shooting in April, the incident prompting s… https:\/\/t.co\/G1MqoiUmff"},{"tag":"real","text":"#Bahrain allowed the entry of #Saudi citizens to its lands without border procedures on the occasion of the school holiday\n\nhttps:\/\/t.co\/XuomhIZVjD"},{"tag":"real","text":"King Salman receives dignitaries in Riyadh https:\/\/t.co\/mvIp4pn69k https:\/\/t.co\/MHEQoJzhIH"},{"tag":"real","text":"Saudi Crown Prince Mohammed bin Salman plans to launch a $425 billion infrastructure plan on Monday https:\/\/t.co\/M2XmcJ42xs via @markets by @A_DiPaola17"},{"tag":"real","text":"#Saudi German Hospital likely to post 26% profit slump in Q4 2018, data compiled by Argaam shows https:\/\/t.co\/wGzJYwNhyP #healthcare https:\/\/t.co\/sZMrmXNmu9"},{"tag":"fake","text":"#AlHilalVsAlRaed \n#MBS_ProLeague \n\n#AlHilal (0) - (0) Al-Raed https:\/\/t.co\/2v08tCGD7f"},{"tag":"real","text":"From toy drone being shot down to attempted coup,  now im reading an attack by #Houthi group. Rumours that the vide… https:\/\/t.co\/GGRQWhHalP"},{"tag":"fake","text":"Mariah Carey performed in concert in Saudi Arabia Thursday night, despite calls to cancel the show over allegations of human rights abuse in the country https:\/\/t.co\/7JqcLNaTDd https:\/\/t.co\/ancCsdTVZT"},{"tag":"real","text":"#Riyadh | #CrownPrince Mohammed bin Salman and U.S. Secretary of State @SecPompeo discussed areas of strategic partnerships between the two countries 🇸🇦🇺🇸 https:\/\/t.co\/VAiiwmWeey"},{"tag":"fake","text":"The #Saudi -Blockade on Sana'a Airport makes Millions of Civilians in a prison without any fualt   #EndYemenSiege"},{"tag":"fake","text":"Earlier this week Saudia Arabia executed Tuti Tursilawati, a Filipina domestic worker who a human rights group says killed her employer while defending herself from sexual assault. https:\/\/t.co\/52FKhdnMtc"},{"tag":"fake","text":"Mariah Carey performs in Saudi Arabia despite calls for boycott over human rights concerns | World News | Sky News https:\/\/t.co\/NU76L0GNuy"},{"tag":"fake","text":"Mohammed bin Salman murders reporters and abuses women https:\/\/t.co\/LPUvRYB3Og"},{"tag":"real","text":"#BREAKING(MNA)--#Saudi teen who fled family will leave Thailand for Canada on Friday night - Thai immigration chief. \n\n#MNA #MNA_English #Anglophones https:\/\/t.co\/2b7MTpyqkd"},{"tag":"real","text":"#Saudi delegation explores investment avenues in #Pakistan’s Port of #Gwadar https:\/\/t.co\/n834gdmzYp"},{"tag":"fake","text":"The #WashingtonPost have admitted the massive support my #Qatar to use #Khashoggi articles to send messages by his name through his articles https:\/\/t.co\/V5kTyAbhDC"},{"tag":"fake","text":"https:\/\/t.co\/npIDaF9kDD\nSaudi King Salman very ill, in ICU.\nSaudi Arabia's King Salman bin Abdulaziz Al Saud is rep… https:\/\/t.co\/6S0da8cDua"},{"tag":"real","text":"Here is how #Saudi courts are prepared with an instant translation in different languages. https:\/\/t.co\/XHKvIejSFy"},{"tag":"real","text":"The owners of @ManUtd, the Glazer family, have no plans to sell the club despite reports the Crown Prince of Saudi… https:\/\/t.co\/mrOdJkCmf8"},{"tag":"fake","text":"#UN believes #MbS prime suspect in #Khashoggi murder: #Turkish official\n\nhttps:\/\/t.co\/6ulSoKdih5 https:\/\/t.co\/6ulSoKdih5"},{"tag":"real","text":"Baker Hughes wins three-year #Saudi Aramco contract that will create 200 engineering #jobs 🇸🇦 | #SaudiArabia #careers https:\/\/t.co\/0v0shsd2tq"},{"tag":"real","text":"King announces plans to set up Saudi Space Agency\nhttps:\/\/t.co\/AMukblubwW #Saudi #KSA"},{"tag":"real","text":"In 2018 Saudi Arabia witnesses an unprecedented achievements after choosing MBS as the crown prince #منح_الجامعة_العربية_المفتوحة"},{"tag":"real","text":"Saudi Arabia responded by freezing new trade and investment deals, suspending flights to Canada, reassigning students studying there and expelling Canada's ambassador to Saudi Arabia, while recalling its own. https:\/\/t.co\/XqPo2NkRew"},{"tag":"real","text":"Sanad Mohammed bin Salman will launch the \"Sanad of marriage\" initiative in pursuit of the principles of family stability, urging young people to marry and motivate those who are unable to enable them to build their families and achieve happiness for them.\n\n#MBS\n#SaudiArabia https:\/\/t.co\/eELcgm3amk"},{"tag":"real","text":"Minister of Tolerance receives #Saudi's Shura Council delegation\nhttps:\/\/t.co\/dQ2A3Bvimg\n#Sharjah24 https:\/\/t.co\/EIylTWXVPo"},{"tag":"real","text":"#Saudi woman held at #Bangkok airport says fears death if repatriated\n\n#MNA_English \n#MNA \n#Anglophones https:\/\/t.co\/OysRQG0SWH"},{"tag":"real","text":"A number of #Saudi female lawyers have said the new system introduced by the Justice Ministry to notify married #women through SMS in case of divorce, will put an end to situations where women are the last ones to know about their latest marital status\n\nhttps:\/\/t.co\/HBpWEWYzQJ"},{"tag":"real","text":"A number of #Saudi female lawyers said the new system introduced by the Justice Ministry to notify married women through SMS in case of divorce, will put an end to a situation where the women are the last ones to know about their latest marital status:\n\nhttps:\/\/t.co\/HBpWEWGYs9"},{"tag":"real","text":"A Huge #Golf #Tournament Is Coming To #Saudi This #Month And Several Big Names Have Already Signed Up For It\nhttps:\/\/t.co\/F0zEZzDzp8 https:\/\/t.co\/JzJsKE1z0U"},{"tag":"real","text":"Pompeo spends 45 minutes with Crown Prince Mohammed bin Salman in Saudi Arabia – NBC News. https:\/\/t.co\/h6Xu2vWqfj Via https:\/\/t.co\/jVghuki52X"},{"tag":"real","text":"#Construction on #Saudi Arabia's 334-sqkm Qiddiya to begin in 2019, CEO confirms 🎡🇸🇦 | #SaudiArabia | @qiddiya https:\/\/t.co\/DF4gCY0v4M"},{"tag":"real","text":"BREAKING: #Saudi General Prosecutor: Eleven accused appeared in court in #JamalKhashoggi killing case https:\/\/t.co\/zydX7hRKT3"},{"tag":"real","text":"Turkey took control of the story after the killing as a major source to the media, #Qatar supported its side of the story and the two countries made great efforts to use the incident to attack #Saudi &amp; its relationship with the US in particular.\n#WashingtonPost\n#Khashoggi https:\/\/t.co\/BcKz0Jl6yQ"},{"tag":"fake","text":"\"Some journalists can service and bolster oppressive power, without ever being held to account themselves.\"\nhttps:\/\/t.co\/Qfdvx4gC7I"},{"tag":"real","text":"Volatility in oil prices casts shadow over 2019 outlook\n\n#ArabNews #Weekly_Energy_Recap\n1st independent #energy market analysis in #Middle_East\n\n#OPEC #Oil #CrudeOil\n#OilPrice #OilandGas #Oil #GIQ\n#Saudi #Aramco #OOTT #SPAGOV\n#Faisal_Mrza\n\n@ArabNews\n\nhttps:\/\/t.co\/TEgFh1Q2Ag"},{"tag":"fake","text":"#Pakistan's relations with many #countries had been improved further due to successful #diplomacy of the incumbent Govt, #Saudi rulers would visit Pakistan on Feb 18 &amp; there would be more engagements between the two brotherly countries: FM #ShahMehmoodQureshi \n\n@ForeignOfficePk https:\/\/t.co\/ekcSKRzkjI"},{"tag":"real","text":"As part of #Saudi efforts to control drone usage in the kingdom, all drones must be registered and each flight also requires permission. \"How quickly GACA can approve those requests will be seen in the coming days and weeks.\" https:\/\/t.co\/o0X1dDnO21"},{"tag":"real","text":"📋 #AlHilal starting XI and Subs for #AlHilalVsAlRaed in \n#MBS_ProLeague https:\/\/t.co\/HOqDJf8OYL"},{"tag":"fake","text":"Saudi women activists are being held in jail, tortured and threatened with rape. Join the call to celebrities like Jay-Z, Trevor Noah, and more to join the cultural boycott of Saudi Arabia, and bring an end to this crazy crackdown on human rights! https:\/\/t.co\/rtNJlPjuka"},{"tag":"fake","text":"Heavy gunfire in #Saudi Royal Palace in Riyadh. King Salman evacuated. Did Saudi Arabia just experience an attempted coup?"},{"tag":"real","text":"We are targeting both school leaders and teachers in Int. Schools to share their knowlege, experineces, and challenges #education #Saudi #schools"},{"tag":"real","text":"#Saudi Arabia announces rise in #oil reserves after external audit #OOTT  https:\/\/t.co\/iAxtpuG8WP"},{"tag":"real","text":"#SaudiArabia announced it will launch a giant #entertainment complex complete with cinemas, live performance venues and sports facilities to be built in #Riyadh #Vision2030 \n\nhttps:\/\/t.co\/piJx4O8ntA https:\/\/t.co\/7aTmxyedwC"},{"tag":"fake","text":"Oldest #photo taken of King Salman; King of #Saudi Arabia, with his Father King Abdulaziz Al-Saud; the founder and Unifier of The Kingdom 80 years ago. \n-\n\n#KingSalman\n#MBS https:\/\/t.co\/4xI3vlBYwK"},{"tag":"real","text":"#Saudi Aramco has reportedly finalised a procurement deal with #Russia's Novomet 🇷🇺🇸🇦 | #engineering #oilandgas | @Novomet_Perm @Saudi_Aramco https:\/\/t.co\/U90PzV4JTA"},{"tag":"real","text":"Al falih says: the kingdom has the lowest production cost in the world and wells in the kingdom on average produce 10 times more than the industry average #OOTT #saudi"},{"tag":"real","text":"#AFP: Buthaina's life changed drastically since last year -- orphaned in #Sanaa, the little girl ended up in #Saudi for medical care and has just returned to #Yemen's capital.\nHer parents, 4 sisters, bother and uncle, died in an air strike.\nhttps:\/\/t.co\/kY8XmcgM69 @AFP @AFPphoto https:\/\/t.co\/2NQKUNNE5C"},{"tag":"real","text":"BREAKING: #Saudi @KingSalman renews guidance to ministers and officials in line with the implementations of projects contained in the budget, in the interest of continuing to work towards the achievement of comprehensive #development in all regions of the Kingdom. https:\/\/t.co\/o1TWInSczO"},{"tag":"real","text":"Pompeo spends 45 minutes with Crown Prince Mohammed bin Salman in Saudi Arabia – NBC News. https:\/\/t.co\/6sNQyxychJ Via https:\/\/t.co\/jVghuki52X"},{"tag":"real","text":"Recently, Saudi Arabia warned its citizens that \"sharing or spreading rumors or fake news that might affect public… https:\/\/t.co\/8lV8KvRFBJ"},{"tag":"real","text":"ICYM #Saudi woman facing deportation by Thailand after fleeing family https:\/\/t.co\/gBT0ADK0qM via @bpolitics"},{"tag":"fake","text":"Why Women Flee Saudi Arabia: Daily Brief: Human Rights Watch https:\/\/t.co\/GAxWVLXY8r | More w\/ Eco-Search: https:\/\/t.co\/RjcRVNRCIF"},{"tag":"real","text":"WATCH: #Saudi man drew attention on social media by playing and talking to #animals https:\/\/t.co\/qUzUJeomWT"},{"tag":"real","text":"@AlJanadriaFest |#SDRPY Supervisor, #Saudi Amb. to #Yemen Mohamed AlJabir: Development outcomes revolve around improving the standard of life, community security and income through agricultural and vocational production along with the financial services policies efficiency. https:\/\/t.co\/S7F7GPidmc"},{"tag":"fake","text":"Why doesn't the reporter dig deeper into why Turkey encouraged #Khashoggi to enter consulate even tho Turkey knew, thru listening devices, that a confrontation was planned? Why did Turkey allow alleged killers' planes to land &amp; then take off? They knew all the time. Complicity! https:\/\/t.co\/NXbq5ZJkFe"},{"tag":"real","text":"#happeningnow\nThe anniversary of the pledge of allegiance to King Salman Al Saud, under the patronage of the Rector Dr. Huda Al Ameel. #pnu https:\/\/t.co\/SJrcKUfEdT"},{"tag":"real","text":"Heavy gunfire near Saudi King’s palace in Riyadh. The shooting erupted when the palace guards targeted a small dron… https:\/\/t.co\/SiWExfm5s0"},{"tag":"fake","text":"Saudi women activists are being held in jail, tortured and threatened with rape. Join the call to celebrities like Jay-Z, Trevor Noah, and more to join the cultural boycott of Saudi Arabia, and bring an end to this crazy crackdown on human rights! https:\/\/t.co\/D7pR8xrCqL"},{"tag":"real","text":"The #Saudi Development and Reconstruction Program for #Yemen was delighted to begin distribution of nearly 200,000 books to #Yemen-i school children in December. https:\/\/t.co\/qIO0FbfYnC"},{"tag":"real","text":"PICTURES: Newly appointed Princes, ministers and members of the Shura Council take their oath in front of #Saudi @KingSalman https:\/\/t.co\/QKBENDaF3C"},{"tag":"real","text":"#Saudi woman seeking asylum 'under the care' of UN agency: #Thailand official https:\/\/t.co\/sYL96oeanO"},{"tag":"real","text":"#Saudi #PIF entertainment company plans to build leisure complex in #Riyadh https:\/\/t.co\/JWiaQ7JX2Q"},{"tag":"real","text":"#Images #reveal #dramatic #facelift of #Awamiya in #Saudi’s #Eastern’s #Province \n\nContinue reading at https:\/\/t.co\/CFB0OSppNC | #Gulflance"},{"tag":"real","text":"Saudi Market Daily Report 07\/01\/2019\nhttps:\/\/t.co\/ezsb3VkM24 \n#Tadawul #Tasi #KSA #Saudi https:\/\/t.co\/jdJFJw8Uzt"},{"tag":"real","text":"🔴We confirm that Dr. Ruqqayya al-Muhareb (a famous #Saudi University Professor) was subjected to a secret trial in which the General Prosecution asked for DEATH PENALTY against her because of false accusations. https:\/\/t.co\/mbtMfrlurU"},{"tag":"real","text":"Saudi Market Daily Report 31\/12\/2018\nhttps:\/\/t.co\/BiNR80yJCG \n#Tadawul #Tasi #KSA #Saudi https:\/\/t.co\/g1phuw1rzf"},{"tag":"fake","text":"While Saudi teen Rahaf Mohammed al-Qunun's own close encounter with officials in Bangkok is over, there's still the case of #SaveHakeem \n\nActivists Start Campaign for Thailand to Free Bahraini Soccer Player https:\/\/t.co\/edKnW4KjQO"},{"tag":"real","text":"BREAKING: #Saudi General Prosecutor: First trial session to be held against those involved in #JamalKhashoggi killing https:\/\/t.co\/5nXNHJc1ru"},{"tag":"fake","text":"The sister of Loujain al-Hathloul, 29-year-old #Saudi women's rights activist detained with her husband last year, has written a @nytopinion piece on the eve of @SecPompeo's second #Riyadh trip since the #JamalKhashoggi murder https:\/\/t.co\/Uga2xXWuVg"},{"tag":"real","text":"#CrownPrince #MohammedBinSalman visited many countries such as US, Spain, France, UK and signed agreements that will effectively benefit our country #SaudiArabia we are proud of #MBS https:\/\/t.co\/log4cREIAP"},{"tag":"fake","text":"A #Turkish pro-government television channel has broadcast video showing men carrying suitcases purportedly containing the remains of #Saudi journalist #JamalKhashoggi into the residence of his country’s consul general in #Istanbul.\n\n#MNA_English \n#MNA \n#Anglophones https:\/\/t.co\/1DcEvveQUP"},{"tag":"real","text":"In March 2017, #Canada SEIZED #Yemen refugees at #US boarder escaping war; as opposed to granting asylum last Saturday to 18Y #Saudi who fled her family!\n\n#humanrights my A**! Politics?\n\n#pervert #SaveRahaf #HRW #amnesty #HRD #HRC #Qunun #NGO #RahafisFree #rahaf #SaudiArabia #رهف https:\/\/t.co\/usTHhPW24O"},{"tag":"real","text":"#Saudi Arabia’s economic growth is expected to increase 2.5% by 2020, says a report by National Bank of Kuwait  https:\/\/t.co\/xy6NVI14j0"},{"tag":"real","text":"@DHamamdjian @CTVNews @rahaf84427714 Bad news for our friends in #Canada and elsewhere, as #Saudi embassy in #Thailand refused to interfere in #RahafAlQanun issue as it’s a family conflict in other country, and living in #Kuwait not in #SaudiArabia  \nSorry guys!!!!"},{"tag":"real","text":"Mother of #Saudi princess passes away \nhttps:\/\/t.co\/tMNedne32y https:\/\/t.co\/AXhzyfCDfF"},{"tag":"real","text":"Saudi Market Daily Report 01\/01\/2019\nhttps:\/\/t.co\/XhHgwpnafu \n#Tadawul #Tasi #KSA #Saudi https:\/\/t.co\/m3ti5TNCkO"},{"tag":"fake","text":"@Almatrafi #saudi is using children to spread hate speech ..\n\n@UNICEF\n@UNICEFmena\n@UNICEFinArabic\n@UNESCOarabic \n@UNESCO \n@savechildrenmee \n@hrw_ar \n@hrw \n@CRAE_official\n@AmnestyAR \n@amnestyusa"},{"tag":"real","text":"#Saudi prosecutor seeks death sentences as #Khashoggi murder trial opens\n\n#MNA_English \n#MNA \n#Anglophones https:\/\/t.co\/EUdRE3HoOy"},{"tag":"fake","text":"Key suspect in Khashoggi trial and former top royal adviser disappears https:\/\/t.co\/1vZbqikzQN"},{"tag":"real","text":"Institutions in #Saudi Arabia work together for environment protection. https:\/\/t.co\/BKLr0KsQ3i"},{"tag":"real","text":"#BreakingNews: Saudi prosecutor seeks death sentences for five suspects as #Khashoggi murder trial opens\n#BREAKING #SaudiArabia https:\/\/t.co\/hkL5Z0myRu"},{"tag":"fake","text":"Under MBS, Saudi Arabia Accused of Torture — Again https:\/\/t.co\/lDudPtwDgf"},{"tag":"fake","text":"Amid global outrage, Saudi authorities drop #deathpenalty against female activist who participated in peaceful anti-government protests. https:\/\/t.co\/vCLbtDEPe0 @newsweek @DPInfoCtr @Amnesty @DeathPenaltyWW #IsraaAlGhomgham"},{"tag":"fake","text":"Musicians will cancel concerts in Israel bc ohmuhgod Israel is sooo mean, but Mariah Carey will perform in Saudi Arabia where women’s rights activists are imprisoned for wanting basic human rights. 🤷‍♀️"},{"tag":"fake","text":"Pic projects #Saudi released prisoner(while being treated in #Sanaa)vs prisoner who was lately executed by #KSA #USA mercenaries while video taped! No matter how aggressors media try 2 distort Ansaruallah &amp; other #Yemenis, labeling them \"Houthis\", truth will always clear ur lies https:\/\/t.co\/PuV40BU2Lc"},{"tag":"real","text":"#Saudi @KingSalman approves raft of measures to improve quality of #health services — https:\/\/t.co\/KT3PJEceA3 https:\/\/t.co\/Zs9SO4cKcI"},{"tag":"real","text":"Saudi Crown Prince Mohammed bin Salman plans to launch a $425 billion infrastructure plan on Monday https:\/\/t.co\/NNDg9kULII via @markets"},{"tag":"fake","text":"#Saudi students facing jail time in the United States go missing to avoid trial.  https:\/\/t.co\/DOEJlosbKV via @nbcnews"},{"tag":"real","text":"STC\nQ4: Good set of numbers\nhttps:\/\/t.co\/w2iO8K60UY\n#Tadawul #Tasi #KSA #Saudi https:\/\/t.co\/5CdSFHIvQH"},{"tag":"real","text":"#Swiss Federal Councillor @alain_berset, head of the Federal Department of Home Affairs which includes, among others, the Federal Office of Culture, met in #Davos with the #Saudi film director @HaifaaMansour who received the #WEF19 25th Crystal Award for cultural achievement https:\/\/t.co\/Q8ZINl4TX4"},{"tag":"real","text":"In response to the @nytimes article falsely claiming that #Saudi paid for Sudanese child soldiers to fight in #Yemen👇🏼 https:\/\/t.co\/KBINZBJTtT"},{"tag":"fake","text":"In November #Lebanon’s Prime Minister, Saad Hariri, was kidnapped, detained, reportedly slapped around, forced to r… https:\/\/t.co\/Z2JpVtXlgf"},{"tag":"real","text":"#Saudi labor law protects the rights of both employees and employers, and serves as a reference for any disputes that may arise in a work place. https:\/\/t.co\/bOQVCHLZY7"},{"tag":"real","text":"#Saudi Arabia's Crown Prince #Mohammed bin Salman poses for a selfie during the Future Investment Conference in #Riyadh. \n\n#MNA #MNA_English #Anglophones https:\/\/t.co\/H5i22MOgzk"},{"tag":"real","text":"#AndreaBocelli Stars in Opera Night at #Saudi’s Winter Tantora Festival https:\/\/t.co\/Blc7JszC25 https:\/\/t.co\/OxssNmEy52"},{"tag":"fake","text":"In #Yemen more 30.000 died due to The #Saudi - coalition Blockade on Sana'a Airport since 2 years ,the number inceases everyday  #EndYemenSiege"},{"tag":"real","text":"The #Saudi human resources policies &amp; procedures manual is in compliance with the latest Labor Law Regulations. The human resources manual consist of 12 structured policies and 19 related forms. #riyadh #jeddah\n\nhttps:\/\/t.co\/RGSthRqAgE https:\/\/t.co\/8z9waKg9ms"},{"tag":"real","text":"KSA: 609632 illegal expats deported in 2018.. The number of illegal foreigners detained by the #Saudi authorities in a nationwide crackdown that began in November 2017 has reached 2… https:\/\/t.co\/ffVZyFeZqJ"},{"tag":"real","text":"#Saudi Shoura to debate two key laws — To examine organ donation, #marriage of minors this week — https:\/\/t.co\/WbcKJg6O7N https:\/\/t.co\/gye9gSVNis"},{"tag":"real","text":"PICTURES: #Saudi @KingSalman receives ambassador of #Kuwait on occasion of the end of his term as #ambassador of his country to the Kingdom. https:\/\/t.co\/WJF14PypCg"},{"tag":"real","text":"81856 #Job opportunities provided by #Saudi Arabia to #Yemenis during the past year without political or regional discrimination, which contributed to the operation of organized labor and supporting the national economy, in addition to a quarter of a million other visas issued https:\/\/t.co\/25dR5z4Nie"},{"tag":"real","text":"King Salman receives president of the Inter-Parliamentary Union - https:\/\/t.co\/EmXRj8Iw6o - https:\/\/t.co\/Ifj7fd9iKg - RiyadhVision https:\/\/t.co\/48dQRHq82Y"},{"tag":"real","text":"4 months after Saudi journalist Jamal #Khahsoggi murder, Turkey is still after his body. Istanbul Prosecutor's Office claims his body was dismembered. Finding #Khashoggi's body parts is essential for a proper final of the investigation and preparation of an indictment. https:\/\/t.co\/4M2kARfNx2"},{"tag":"real","text":"KHASHOGGI'S SON LEAVES SAUDI ARABIA The son of journalist Jamal Khashoggi has left Saudi Arabia and traveled to the… https:\/\/t.co\/56TNdRfN0I"}]